//React
import React, { Component } from "react";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import { computerItem4__pic1 } from "../../../../Components/NewsImage/NewsImage";
import Comments from "../../../../Components/Comments/Comments";
import { Fade } from "react-reveal";
//Modules

class ComputerItem4 extends Component {
  state = {
    commentsArray: [
      {
        id: "c4-1",
        name: "سیمین",
        comment:
          "  من همیشه دغدغه ی این رو داشتم که بازی سیستم رو خرای میکنه یا نه ! الان متوجه شدم . دست شما دردنکنه ",
      },
      {
        id: "c4-2",
        name: "رضا",
        comment: " من یه گیمیر ام ، از طرف گیمیر ها از شما تشکر میکنم  ",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>بازی با لپ تاپ می تونه به لپ تاپ آسیب بزنه ؟</h2>
          <p>
            بازی با لپ تاپ چقدر می تونه روی قطعات تاثیر گذار باشه ؟ یعنی آیا
            بازی با لپ تاپ می تونه باعث خرابی لپ تاپ بشه ؟
          </p>
          <h2>تاثیر بازی با لپ تاپ روی باتری</h2>
          <p>
            موقعی که دارید با لپ تاپ بازی می کنید ، همه قطعات درگیر میشن .
            پردازنده ، کارت گرافیک ، رم ، هارد ، نمایشگر ، کیبورد و تاچ پد و
            خلاصه همه قطعات همزمان باید کار کنن . این یعنی باتری باید تمام این
            قطعات رو پشتیبانی کنه . باتری لپ تاپ های معمولی ، بین 2 تا 6 سلول
            هستن . هر چی تعداد سلول ها بیشتر باشه ، یعنی باتری قوی تر و جون دار
            تره ( البته استثنا هم هست ، یه سلول می تونه به قدرت 2 تا سلول باشه )
            . در مورد{" "}
            <Link to="/computer-item-6" style={{ color: "red" }}>
              تفاوت باتری 4 سلولی و 6 سلولی
            </Link>{" "}
            قبلا توضیح دادم پیشنهاد می کنم حتما بخونید . باتری لپ تاپ معمولی نمی
            تونه همزمان ، برق همه قطعات رو تامین کنه ، بخاطر همین ، موقعی که
            شارژر به لپ تاپ وصل نیست و شما بازی می کنید ، بازی به اصطلاح لگ Lag
            می زنه . یعنی بازی روان اجرا نمیشه و هی تیکه تیکه میشه و با تاخیر
            اجرا میشه . دلیلشم همینه که گفتم ! باتری نمی تونه برق همه قطعات رو
            تامین کنه . اما اگه همون لحظه شارژر رو به لپ تاپ بزنید ، بازی روون
            اجرا میشه . درسته که شارژر باعث میشه بازی روون اجرا بشه اما یه مشکل
            هم این وسط وجود داره .
          </p>
          <p>
            موقعی که شارژر رو وصل می کنید ، باتری درگیر شارژ و دشارژ میشه و بازم
            بهش فشار میاد . درسته ، باتری برای شارژ و دشارژ شدن هست ، اما هر چی
            بیشتر در معرض شارژ و دشارژ قرار بگیره ، زودتر عمرش تموم میشه . قبلا
            در مورد{" "}
            <Link Link to="#" style={{ color: "red" }}>
              چرخه شارژ باتری
            </Link>{" "}
            صحبت کردم . پس بازی با لپ تاپ می تونه در طول زمان روی باتری لپ تاپ
            تاثیر منفی بذاره .
          </p>
          <img
            src={computerItem4__pic1}
            data-tip="بازی با لپ تاپ"
            alt="laptop Gaming"
          />
          <h2>تاثیر بازی با لپ تاپ روی قطعات</h2>
          <p>
            ببینید ، هر لپ تاپ برای کار مشخصی طراحی شده . قطعات داخل لپ تاپ ها ،
            حتی نوع کیبورد و تاچ پد و نمایشگر هم بر اساس نوع کاربری لپ تاپ ها
            انتخاب میشن . در حال حاضر چند نوع کاربری در لپ تاپ ها داریم ، کاربری
            عام ، کاربری مالتی میدیا ، کاربری مخصوص بازی یا گیمینگ ، کاربری
            صنعتی و … لپ تاپ با کاربری عام ، مخصوص کارهای دم دستی و اولیه طراحی
            شده مثل کار با نرم افزار word و وبگردی و فتوشاپ ساده . کاربری مالتی
            میدیا هم مخصوص کارهای گرافیکی و موسیقی و ویدیو طراحی شده . نه کاربری
            عام و نه کاربری مالتی میدیا ، مخصوص بازی نیستن . درسته با لپ تاپ
            مالتی میدیا میشه بازی کرد اما بازم تو بازی های سنگین کم میاره .
            اینکه میگم کم میاره ، مشکل اصلیه . معنی کم آوردن یعنی اینکه سی پی یو
            یا کارت گرافیک نمی تونن جزئیات اون بازی رو پردازش کنن و داغ میشن .
            مثل این میمونه شما با پراید بخواید یه بار نیسان رو جابجا کنید ، خب
            به پراید فشار میاد . هرچند پراید قابلیت های نهفته ای داره
          </p>
          <p>
            همونطور که می دونید گرما قاتل اصلیه قطعات الکترونیکی هستش پس اگه با
            یه لپ تاپ معمولی ، بازی سنگین یا نیمه سنگین اجرا کنید ، قطعات داخلی
            داغ میشن و به مرور زمان عمرشون کم میشه و حتی ممکنه بسوزن .
          </p>
          <p>
            پس ما دو تا نتیجه گرفتیم ، بازی با لپ تاپ می تونه به باتری آسیب بزنه
            ، بازی با لپ تاپ می تونه عمر قطعات رو کم کنه .
          </p>
          <h2>نکات ریز در مورد بازی با لپ تاپ</h2>
          <p>
            ■ اگه می خواید با لپ تاپ بازی کنید توصیه می کنم موس و کیبورد و دسته
            جداگونه بخرید تا کیبورد و تاچ پد تون خراب نشه .
          </p>
          <p>
            ■ موقعی که با لپ تاپ بازی می کنید نور نمایشگر لپ تاپ رو تا جایی که
            می تونید کم کنید ، چون نمایشگر خیلی باتری مصرف می کنه .
          </p>
          <p>
            ■ تو جای گرم به هیچ وجه با لپ تاپ بازی نکنید چون بازی ، بدجوری قطعات
            رو درگیر میکنه و داغ میشن .
          </p>
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default ComputerItem4;
