//React
import React, { Component } from "react";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
import ReactTooltip from "react-tooltip";
import {
  mobileItem1__pic1,
  mobileItem1__pic2,
  mobileItem1__pic3,
  mobileItem1__pic4,
  mobileItem1__pic5,
  mobileItem1__pic6,
  mobileItem1__pic7,
} from "../../../../Components/NewsImage/NewsImage";
import Comments from "../../../../Components/Comments/Comments";
import { Fade } from "react-reveal";
//Modules
class MobileNews1 extends Component {
  state = {
    commentsArray: [
      {
        id: "m1-1",
        name: "علی",
        comment:
          "من خودم پاور بانک دارم ، خیلی مطالب شما مفید و کاربردیه ، اگر بخوام به کسی پیشنهاد بدم چطور بخره ، حتما سایت شما رو معرفی میکنم",
      },
      {
        id: "m1-2",
        name: "نرگس",
        comment: "خیلی مفید بود ، تشکر",
      },
      {
        id: "m1-3",
        name: "نازنین",
        comment: "خیلی خوب توضیح دادین ، ممنون",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade lef>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>پاوربانک تقلبی چجوریه ؟ تشخیص پاوربانک فیک</h2>
          <p>
            پاوربانک تقلبی یکی از چیزاییه که میتونه حتی باعث مرگ افراد بشه ! این
            مقدمه تند و خشن رو گفتم که بدونید موقع خرید پاوربانک باید خیلی
            حواستون رو جمع کنید ! چون شارژ کردن گوشی مسئله ساده ای نیست و
            همونطور که بارها هم تو اینترنت دیدین ، باتری گوشی میتونه خیلی راحت
            منفجر شه ! دلیل انفجار باتری گوشی ، استفاده از باتری و شارژر های غیر
            استاندارده ! پاوربانک هم یه جور شارژره دیگه ! من تو این پست میخوام
            روش های شناسایی پاوربانک فیک یا تقلبی رو بهتون بگم با من همراه باشید
            .
          </p>
          <img
            src={mobileItem1__pic1}
            data-tip="تشخیص پاوربانک تقلبی یا فیک از اصلی"
            alt=""
          />
          <p>
            تو این مقاله سعی کردم راه های عمومی برای تشخیص پاوربانک فیک یا تقلبی
            رو بهتون بگم اما چون پاوربانک های شیائومی تو ایران زیاد فروخته میشن
            بعضی راه ها رو هم صرفا برای تشخیص پاوربانک تقلبی شیائومی نوشتم !
          </p>
          <h2>کد امنیتی یا سریال نامبر پاوربانک تقلبی</h2>
          <p>
            ساده ترین راه واسه تشخیص محصولات تقلبی اینه که سریال نامبرش رو چک
            کنید . الان دیگه تمام محصولات اریجینال یا اصلی سریال نامبر معتبر
            دارن که میتونید داخل سایت شرکت سازنده وارد کنید و ببینید که شناسایی
            میشه یا نه .
          </p>
          <p>
            هرچند الان شرکت هایی که محصولات تقلبی تولید میکنن میرن سریال
            نامبرهای اصلی رو هم کپی میکنن رو محصول خودشون اما این کار بازم توسط
            سایت اصلی قابل شناساییه ! مثلا شرکت شیائومی توی سایتش میزنه که سریال
            این محصول قبلا توسط کاربران دیگه هم وارد شده !
          </p>
          <p>
            مثلا شکل بالا ، تصویر سایت شیائومی رو نشون میده که میتونید محصول
            خودتون رو چک کنید . واسه اینکار کافیه کد امنیتی پشت کارتن پاوربانک
            رو بخراشید و تو سایت وارد کنید . میتونید به{" "}
            <a
              href="https://www.mi.com/global/verify/#/en/tab/imei"
              style={{ color: "red" }}
            >
              این آدرس
            </a>{" "}
            برید .
          </p>
          <p>
            اما سریال نامبر فقط یکی از راه های تشخیص پاوربانک فیک هستش ، در
            ادامه راه های بیشتری رو خدمتتون میگم .
          </p>
          <h2>ظرفیت واقعی و ظرفیت نامی پاوربانک فیک</h2>
          <p>
            پاوربانک خودش مثل گوشی باید شارژ و دشارژ بشه چون باتری داخلشه !
            ورودی پاوربانک معمولا 5 ولت 1 آمپر یا دو آمپره ! 1 آمپر یعنی همون
            1000 میلی آمپر . حالا یه مثال میزنم ، فرض کنید یه پاوربانک 6000 میلی
            آمپری دارید و خالیه ، اگه به شارژ وصلش کنید باید تو 6 ساعت شارژ کامل
            بشه ( با ورودی 1000 میلی آمپر که خط قبلی گفتم ) اما درکمال تعجب مثلا
            تو سه ساعت شارژ کامل میشه این یعنی اینکه پاوربانک 6000 میلی آمپر
            نیست و کمتره ! یه جورایی شبیه به شارژ ایرانسل میمونه ، یه شارژ 2
            تومنی میخریدیم اما 2 تومن توش شارژ نبود ، 1800 تومن شارژ داشت !
            یادتونه ؟ پس خود این مسئله یکی از راههای تشخیص پاوربانک فیک از اصلیه
            ! حالا یه نکته دیگه هم هست :
          </p>
          <p>
            ببینید این اعداد و ارقامی که روی پاوربانک ها مینویسن ، بیشتر اعداد
            اسمی هستن یعنی اعداد ایده آلن ! در واقعیت دقیقا همون اتفاق نمیفته !
            مثلا یه پاوربانک 10000 میلی آمپری دقیقا 10000 میلی آمپر جریان نمیده
            بلکه کمتره ! حالا اینکه چقدر کمتره ، به کیفیت پاوربانک ها مربوط میشه
            . اما به صورت عرف ، 75 درصد از اون عدد رو به صورت عدد واقعی در نظر
            میگیرن . مثلا پاور بانک 10000 میلی آمپری در واقعیت حدود 7500 تا 8000
            میلی آمپر جریان میده ! حالا یه سری پاوربانک ها تو بازار هستن که به
            اسم پاوربانک 10000 میلی آمپرین اما حتی ظرفیت اسمی شون هم 10000 تا
            نیست بلکه 7500 تاس که اگه 75 درصدش رو حساب کنیم به عدد 5600 میلی
            آمپر میرسیم . پس حواستون به این مسئله باشه !
          </p>
          <h2>کابل شارژ پاوربانک فیک</h2>
          <p>
            ■ روی کابل شارژ پاوربانک های شیائومی هیچ نشانی از برند شیائومی وجود
            نداره اما روی کابل شارژ پاوربانک فیک لوگوی mi دیده میشه .
          </p>
          <img
            src={mobileItem1__pic2}
            data-tip="لوگوی mi روی کابل پاوربانک تقلبی"
            alt=""
          />
          <p>
            ■ کابل شارژ پاوربانک اصلی خیلی محکم و مقاومه و کانکتورها و اتصالات
            خیلی تمیز و منظم هستن ، برجستگی یا تورفتگی خاصی ندارن ، پلاستیک
            اضافه ندارن . این مسئله در شکل بالا هم کاملا مشخصه !
          </p>
          <h2>وزن پاوربانک تقلبی</h2>
          <p>
            یه نکته کنکوری بگم ، هرچی ظرفیت پاوربانک بیشتر باشه ، وزنش هم طبیعتا
            باید بیشتر باشه چون به باتری های بیشتری نیازه . یه قانون تقریبی برای
            این کار وجود داره که بهتون میگم اینم یه گوشه ذهن تون داشته باشید
            قطعا به دردتون میخوره ! اگه یه پاوربانک 2500 میلی آمپری حدود 60 گرم
            وزن داشته باشه ، پاوربانک 5000 میلی آمپری حدود دو برابرش باید وزن
            داشته باشه ، به این اعداد دقت کنید :&nbsp;&nbsp;2500 میلی آمپر 60
            گرم 5000 میلی آمپر 110 گرم 8000 میلی آمپر 160 گرم 10000 میلی آمپر
            190 گرم .
          </p>
          <h2>غلط املایی شارژر همراه تقلبی</h2>
          <p>
            این مسئله در مورد همه وسایل فیک صدق میکنه . معمولا تو لوازم فیک یه
            چیزی رو اشتباه مینویسن ! نمیگم همیشه اینجوریه ها ، بالاخره افرادی که
            تقلب میکنن هم این مسائل رو میدونن و سعی میکنن که خطای خودشونو کمتر
            بکنن اما به هر حال شرکت اصلی ، کلمات و جملات نوشته شده روی محصولاتش
            رو تو چند مرحله چک میکنه اما شرکت فیک اینکارو نمیکنه !
          </p>
          <img
            src={mobileItem1__pic4}
            alt=""
            data-tip="غلط املایی روی پاوربانک تقلبی"
          />
          <p>
            مثلا تو تصویر بالا یه پاور بانک رو میبینید که عبارت Charge You Life
            روش نوشته شده و همونطور که میدونید به جای You باید مینوشت Your . به
            همین سادگی میتونید تقلبی بودن این محصول رو متوجه بشید . شرکت های
            معتبر هیچ وقت از این سوتی ها نمیدن !
          </p>
          <h2>قیمت پاوربانک فیک</h2>
          <p>
            یکی از ساده ترین و دم دستی ترین راه ها واسه شناسایی محصول فیک اینه
            که قیمتش رو با دلارو تومن حساب کنید . حالا چه پاوربانک چه هر محصول
            دیگه ای !
          </p>
          <p>
            هر وقت خواستید پاوربانک بخرید ، قیمت اون محصول رو به دلار در اینترنت
            ببینید و ضربدر 20000 تومن بکنید و یکم هم سود واسش در نظر بگیرید ،
            اگر قیمت اون پاوربانک از محاسبات شما کمتر باشه یعنی پاوربانک فیک و
            ارزون قیمتیه ! اون 20000 تومن قیمت ارز وارداتیه و حداقل قیمتی هست که
            میشه واسه اون محصول در نظر گرفت !
          </p>
          <h2>ظرفیت غیر معقول پاوربانک تقلبی</h2>
          <p>
            پاوربانک هایی که برای گوشی موبایل طراحی میشن ، معمولا بین 5 تا 20
            هزار میلی آمپر هستن یعنی چون بیشتر از این مقدار برای گوشی نیاز نیست
            ! بذارید با اعداد و ارقام مثال بزنم که بهتر متوجه بشین . فرض کنید
            باتری گوشی شما 3000 میلی آمپره ! با یه پاوربانک 15000 میلی آمپری ،
            میتونید تقریبا 5 بار گوشی تون رو فول شارژ کنید ( تو حالت ایده آل ) .
            میبینید که 5 بار ، رقم زیادیه . یا مثلا با یه پاوربانک 20000 میلی
            آمپری میتونید باتری تونو حدود 6 بار فول شارژ کنید که خیلی زیاده ! هر
            چی ظرفیت پاوربانک زیاد میشه طبیعتا تعداد باتری های داخل پاوربانک هم
            بیشتر میشه و پاوربانک سنگین تر میشه .&nbsp;ظرفیت بیشتر از 20 هزار
            میلی آمپر ، به تعداد زیادی باتری نیاز داره . بنابراین اگه یه
            پاوربانک سبک دیدین که زده مثلا 20 یا 30 هزار میلی آمپر ، بدونید که
            احتمال خیلی زیاد فیک یا تقلبیه !
          </p>
          <p>
            از طرف دیگه هیچ شرکت معتبری واسه گوشی پاوربانک بالای 20 هزار میلی
            آمپر نمیزنه چون وزن پاوربانک زیاد میشه ، حجمش زیاد میشه حملش سخت
            میشه و قیمتشم زیاد میشه ! حرف من این نیست که هر چی پاوربانک با ظرفیت
            بالا دیدین قطعا تقلبیه ، نه ! شرکت های معتبری هم هستن که ظرفیت های
            بالا میزنن اما خب قیمت میتونه عامل مهمی باشه که شما بفهمین پاوربانک
            تقلبی هست یا نه چون یه پاور بانک 20 هزار میلی آمپری اریجینال اگه 500
            هزار تومن باشه ، مدل فیک همون مثلا 200 هزار تومنه !
          </p>
          <h2>تست شارژ پاوربانک فیک</h2>
          <p>
            یه سری اپلیکیشن وجود دارن که میتونن جریان ورودی به گوشی تون رو نمایش
            بدن ، یه دونه از این اپلیکیشن ها رو روی گوشی خودتون نصب کنید ( مثل
            اپلیکیشن آمپر ) وقتی خواستید پاوربانک بخرید ، خروجی های پاور بانک رو
            چک کنید ببینید اونی که 2 آمپریه واقعا 2 آمپر خروجی میده یا نه !
            اینجوری میتونید از کیفیت پاوربانک مطمئن بشید .
          </p>
          <img
            src={mobileItem1__pic5}
            data-tip="اپلیکیشن آمپر برای مشاهده مقدار شارژ پاوربانک"
            alt="
          اپلیکیشن آمپر برای مشاهده مقدار شارژ پاوربانک"
          />
          <h2>نکات فنی در مورد پاوربانک تقلبی</h2>
          <p>
            اگر فنی هستین و میتونید پاوربانک رو باز کنید ، میتونید از چند تا
            نشونه ساده بفمید که پاور بانک اصلیه یا فیکه !
          </p>
          <h3>■ اتصال باتری ها به بورد در پاور بانک تقلبی</h3>
          <p>
            تو پاور بانک تقلبی معمولا باتری ها رو خیلی غیر حرفه ای به همدیگه وصل
            میکنن ، از نوع لحیم کردن باتری ها و شلخته بودن لحیم کاری میشه فمید !
            بعضی از پاوربانک ها با سیم های نازک باتریها رو بهم وصل میکنن . رنگ
            باتری های فیک هم معمولا صورتیه !
          </p>
          <img
            src={mobileItem1__pic3}
            data-tip="باتری تقلبی پاوربانک با اتصالات ضعیف"
            alt="
          باتری تقلبی پاوربانک با اتصالات ضعیف"
          />
          <p>
            تو پاوربانک اصلی به هیچ وجه اینکارو نمیکنن ! اتصالات خیلی محکم هستش
            و از سیم استفاده نمیشه . ضمن اینکه روی باتری هم میتونید اسم یه برند
            رو ببینید . مثلا تو تصویر زیر باتری با مارک LG کاملا مشخصه .
          </p>
          <img
            src={mobileItem1__pic6}
            data-tip="باتری اصلی ال جی در پاوربانک اریجینال"
            alt="
          باتری اصلی ال جی در پاوربانک اریجینال"
          />
          <h3>■ باتری تو خالی در پاور بانک تقلبی</h3>
          <p>
            پاوربانک رو باز کنید و باتری ها رو تست کنید ، منظورم از تست اینه که
            دو سر باتری ها رو با ولتمتر اندازه بگیرید ببینید اصن ولت میده یا نه
            و اگه میده چند ولته !&nbsp; احتمالا دیدین که جدیدا تو پاوربانک تقلبی
            ، باتری فیک میذارن و ای کاش که باتری فیک بود ، توش خاک میریزن خودم
            به چشم دیدم اینو !
          </p>
          <h3>■ رنگ باتری پاور بانک تقلبی</h3>
          <p>
            معمولا باتری های موجود در پاوربانک فیک یه دست نیستن و رنگ های
            متفاوتی دارن ، در صورتی که تو پاوربانک های اصلی همه باتری ها یه شکل
            و یه دست هستن ! مثل باتری هایی که تو ویدیوی بالا دیدین .
          </p>
          <h2>رنگ قاب پاوربانک تقلبی</h2>
          <p>
            موقعی که میخواید پاور بانک بخرید ، قبلش میتونیدرنگ بندی مدل مورد نظر
            رو چک کنید ، مثلا پاوربانک شیائومی 10000 میلی آمپر فقط در دو رنگ
            مشکی و قرمز عرضه میشه و پاوربانک 20000 میلی آمپری هم فقط در رنگ سفید
            . بنابراین ، هر رنگی غیر از این رنگ ها رو دیدین قطعا پاوربانک فیک یا
            تقلبیه ! پس حواستون به این نکته هم باشه !
          </p>
          <img
            src={mobileItem1__pic7}
            data-tip="رنگ بندی پاوربانک شیائومی"
            alt="رنگ بندی پاوربانک شیائومی"
          />
          <h2>نوع باتری پاوربانک تقلبی</h2>
          <p>
            توی اینترنت میتونید کالبد شکافی پاوربانک اصلی خودتون رو نگاه کنید .
            مثلا بعضی پاور بانک ها باتری لیتیوم یونی یا پلیمیری استفاده میکنن
            درست مثل باتری گوشی ! یعنی باتری صفحه ای . حالا شما پاوربانک خودتون
            رو باز کنید ، اگه باتریش از نوع قلمی بود ، قطعا پاوربانک فیک گرفتین
            !
          </p>
          <h2>نکات ریز اما مهم در مورد پاوربانک فیک</h2>
          <p>
            ■ در پاوربانک اصل معمولا نوشته های روی پاوربانک کمرنگه ولی وقتی با
            انگشت تون روی نوشته ها بکشید ، میتونید یه حالت برجستگی و یا تو رفتگی
            رو حس کنید اما تو پاوربانک تقلبی نوشته ها پررنگ هستن و برجستگی هم
            ندارن !
          </p>
          <p>
            ■ چراغ های نمایش وضعیت در پاوربانک فیک یا خیلی براق هستن یا خیلی کم
            نور ، خلاصه نور استاندارد ندارن ! اما در پاوربانک اصلی نور این چراغ
            ها خیلی لطیف و مات هستش !
          </p>
          <p>
            ■ پاوربانکی که مقدار شارژ خودش رو نشون نمیده ، قطعا تقلبیه ! الان
            دیگه تمام پاوربانک های اصلی ، میزان شارژ خودشون رو با یه چیزی نشون
            میدن حالا یا نمایشگر دارن یا چراغ های ریز LED .
          </p>
          <p>
            ■ اگر پاوربانک رو با کابل خودش به خودش وصل کردین و شارژ شد بدونید که
            پاوربانک تقلبی هستش !
          </p>
          <p>
            ■ حواستون به ظرفیت های ارائه شده از طرف شرکت اصلی باشه ! مثلا
            پاوربانک های شیائومی در چند ظرفیت مشخص به بازار ارائه شدن مثل 5000
            میلی آمپری ، 1000 ، 16000 و 20000 میلی آمپری ! پس هر پاوربانکی که تو
            این دسته بندی نباشه حتی اگه لوگوی شیائومی روش خورده باشه بازم تقلبیه
            ! پس قبل از خرید ، ظرفیت های اون شرکت مورد نظرتون رو چک کنید .
          </p>
          <p>
            ■ پاوربانک اصلی mi داخل پورت USB شون لوگوی mi نوشته شده ، خیلی ریزه
            اما اگه دقت کنید میتونید اونو ببینید :
          </p>
          <p>
            ■ پاوربانک اصل میتونه همزمان هم خودش رو شارژ کنه و هم گوشی شما رو
            اما پاوربانک فیک اینجوری نیست ! پاور بانک تقلبی یا خودشو شارژ میکنه
            یا گوشی رو ، همزمان نمیتونه این دو تا کار رو مدیریت کنه !
          </p>
          خب دوستان من سعی کردم تمام نکاتی که بلد بودم رو بهتون بگم ، اگه چیزی
          از قلم افتاد به ما بگین تا توی آپدیت های بعدی حتما لحاظ کنیم
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews1;
