import React, { Component } from "react";
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";

//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews14 extends Component {
  state = {
    commentsArray: [],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <h2>تفاوت چیپست و پردازنده اصلی در گوشی</h2>
          <p>
            اگه به مشخصات گوشی های هوشمند نگاه کنید ، می بینید که زده چیپست
            اسنپدراگون و یا اکسینوس بعد پایینش زده پردازنده اصلی مثلا cortex A7
            . چند نفری سوال کردن که آقا چیپست چیه پردازنده چیه و اینا چه فرقی با
            هم دارن منم تصمیم گرفتم خیلی کوتاه فقط تفاوت بین این دوتا رو بگم چون
            قراره یه پست مفصل در مورد چیپست های گوشی موبایل بنویسم .
          </p>
          <h2>فرق چیپست و CPU در گوشی موبایل</h2>
          <p>
            توی گوشی های موبایل ، به خاطر کمبود جا ، طراحان الکترونیک مجبورن که
            چندتا قابلیت رو توی یه تراشه کلی جا بدن ، مثلا کنترلر وای فای و
            بلوتوث ، پردازنده اصلی ، پردازنده گرافیکی ، کنترلر دوربین و خیلی
            چیزهای دیگه که در ادامه می بینید . خود این قطعات واسه خودشون یه
            دنیان ، مثلا پردازنده اصلی از میلیونها ترانزیستور تشکیل شده و به
            همین شکل بقیه موارد ، اما همه این قطعات رو در کنار هم و روی یه قالب
            بزرگتر به اسم چیپست می زنن . به&nbsp; این چیپست در گوشی موبایل ”
            سیستم روی یک چیپ ” یا به انگلیسی System on a Chip و به اختصار SoC
            میگن .
          </p>
          <p>
            کنار هم قرار دادن قطعات ، سرعت و عملکرد کلی سیستم رو بهبود میده چون
            به هم نزدیکن ، توان کمتری مصرف میشه و گرمای کمتری هم تولید میشه . پس
            به زبان ساده ، چیپست بزرگتر از پردازنده اصلیه ، چیپست در گوشی یه
            جاییه که اکثر قطعات اصلی و حیاتی گوشی درونش قرار دارن و CPU یکی از
            همون بخش هاست . شکل زیر ، چیپست اسنپدراگون از شرکت کوالکام رو نشون
            میده که به وفور توی گوشی ها استفاده میشه . همونطور که می بینید ، این
            چیپست از بخش های مختلفی تشکیل شده .
          </p>
          <img src="" alt="" data-tip="چیپست اسنپدراگون 810 و قطعات داخلی" />
          <p>
            چیپست رو می تونید مثل یه مادربورد خیلی کوچولو ( مثل کامپیوتر ) فرض
            کنید که قطعات با باس یا گذرگاه مربوط به خودشون باهم در ارتباطن .
            پردازنده اصلی هم که دیگه می دونید کارش چیه ، تمام پردازش ها و
            هماهنگی ها رو انجام میده . مثلا در چیپست اکسینوس که در گوشی های
            سامسونگ وجود داره و قبلا در موردش توضیح دادم پردازنده های Cortex A7
            و یا مثلا Cortex A53 داخلش هست .البته شاید تو مکالمات عادی و روزمره
            به پردازنده بگن چیپست یا برعکس اما به شکل علمی و منطقی توضیح دادم که
            فرقشون چیه .
          </p>
          <p>
            پس از این به بعد هر وقت توی مشخصات گوشی ها دیدید که چیپست رو از
            پردازنده اصلی جدا کردن می دونید که دلیلش چیه .
          </p>
          <ReactTooltip />
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews14;
