//React
import React, { Component } from "react";
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import {
  computerItem7__pic1,
  computerItem7__pic2,
  computerItem7__pic3,
  computerItem7__pic4,
  computerItem7__pic5,
  computerItem7__pic6,
  computerItem7__pic7,
  computerItem7__pic8,
} from "../../../../Components/NewsImage/NewsImage";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class ComputerItem7 extends Component {
  state = {};
  render() {
    return (
      <Fade left>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>ساتا اکسپرس چیست ؟ تشریح Sata Express</h2>
          <p>
            هر چند وقت یکبار یه تکنولوژی جدید توی دنیای الکترونیک یا کامپیوتر
            معرفی میشه . واسه اینکه موقع خرید قطعات سخت افزاری کاملا آپدیت باشید
            و بعدا پشیمون نشید بهتره که اصطلاحات و فناوری های روز دنیا رو
            بشناسید . ساتا اکسپرس یکی از جدیدترین تکنولوژی هاییه که جدیدا معرفی
            شده و توی مادربوردهای جدید استفاده میشه . بریم ببینیم چیه و چکار می
            کنه ؟ البته توی این پست فعلا قصد دارم فقط بگم این تکنولوژی چیه و
            بعدا اگه اطلاعات بیشتری دستم اومد اضافه می کنم .
          </p>
          <h2>فلسفه وجودی ساتا اکسپرس</h2>
          <p>
            یه زمانی بود که هاردهای مکانیکی حرف اول و آخر توی ذخیره سازی بلندمدت
            رو می زدن . بعدا طراحان الکترونیک متوجه شدن که مکانیکی بودن هارد 50
            تا عیب داره که یکیش سرعت پایین دسترسی به اطلاعات بود . واسه همین
            حافظه های تمام الکترونیکی به نام SSD اومدن . این حافظه ها باید توسط
            یه درگاه استانداردی به مادربورد وصل میشدن که توسط CPU و همچنین سیستم
            عامل قابل شناسایی باشن . قبلا اگه خاطرتون باشه هارد رو با کابل IDE (
            پاتا ) به مادربورد وصل می کردیم و بعدش کابل ساتا اومد که کابل باریک
            تریه و اجازه سرعت بیشتر رو به هارد میده . البته تکنولوژی ساتا این
            اجازه رو میده نه فقط یه کابل خالی ( کابل وسیله است
          </p>
          <p>
            تکنولوژی ساتا از نظر سرعت انتقال دیتا به 4 ورژن اصلی تقسیم میشه .
            ورژن یک که 1.5 گیگابیت ، ورژن دو 3 گیگابیت و ورژن سه هم 6 گیگابیت در
            ثانیه منتقل می کنن . این در حالیه که{" "}
            <Link to="/computer-item-8" style={{ color: "red" }}>
              حافظه های SSD
            </Link>{" "}
            سرعت انتقال بیشتر از 6 گیگابیت در ثانیه رو طلب می کردن . گروه طراحان
            ساتا به این نتیجه رسیدن که طراحی ورژن بعدی ساتا که بخواد 12 گیگابیت
            در ثانیه رو منتقل کنه حدود 2 سال طول می کشه ضمنا توان مصرفی هم مسئله
            مهمی بود و مجبور به تغییرات زیادی توی استاندارد ساتا میشدن . خلاصه
            به این نتیجه رسیدن که{" "}
            <Link to="/computer-item-9" style={{ color: "red" }}>
              تکنولوژی PCI Express{" "}
            </Link>
            ( حتما بخونید )&nbsp;بهترین گزینه است . هم پهنای باند بهتری داره و
            هم اینکه توان مصرفی کمتری . مثلا اگه ساتا ورژن 12 گیگابیتی طراحی
            میشد توی نمودار زیر می بینید که چقدر توان بیشتری مصرف می کرد .
          </p>
          <img
            src={computerItem7__pic1}
            alt="
            مقایسه توان مصرفی ساتای معمولی و ساتا اکسپرس
            "
            data-tip="
          مقایسه توان مصرفی ساتای معمولی و ساتا اکسپرس
          "
          />
          <h2>ساتا اکسپرس Sata Express چیست ؟</h2>
          <p>
            ساتا اکسپرس همونطور که از اسمش مشخصه ترکیب دو تا تکنولوژی ساتا و PCI
            Express&nbsp;هست . ساتا اکسپرس در واقع ورژن 3.2 همون تکنولوژی ساتا
            به شمار میره . به زبون ساده تر ، ساتا اکسپرس یه گذرگاه کامپیوتریه که
            هم قطعات سخت افزاری ساتا و هم قطعات پی سی آی اکسپرس رو ساپورت می کنه
            . مثلا شما می تونید یه هارد ساتای معمولی رو بهش بزنید و استفاده کنید
            همچنین می تونید یه حافظه SSD که برای پورت PCI Express طراحی شده رو
            هم بهش بزنید . لوگوی ساتا اکسپرس رو می بینید .
          </p>
          <img
            src={computerItem7__pic2}
            alt="
            لوگوی ساتا اکسپرس SATA Express"
            data-tip="
          لوگوی ساتا اکسپرس SATA Express"
          />
          <p>
            لازم به ذکره که پورت M.2 ، مدلی از تکنولوژی ساتا اکسپرس هست که بیشتر
            در دستگاه های کوچیک و قابل حمل مثل لپ تاپ و یا آلترابوک استفاده میشه
            .
          </p>
          <img
            src={computerItem7__pic3}
            alt="
            حافظه SSD با استاندارد M.2 در لپ تاپ ایسر اسپایر V3"
            data-tip="
          حافظه SSD با استاندارد M.2 در لپ تاپ ایسر اسپایر V3"
          />
          <h2>طرز کار و اتصالات ساتا اکسپرس</h2>
          <p>
            اگه خاطرتون باشه توی پست PCI Express گفتم که پی سی آی اکسپرس بر اساس
            خطوط انتقال دیتا کار میکنه و هرچی این خطوط بیشتر باشن ، پهنای باندش
            بیشتر میشه و نهایتا سرعت انتقال بیشتر میشه . ساتا اکسپرس هم بر مبنای
            پی سی آی اکسپرس طراحی شده . PCI Express ورژن 2 و یا 3 . در حال حاضر
            اکثر ساتا اکسپرس ها روی مادربوردها ورژن 2 پی سی آی اکسپرس هستن با 2
            خط انتقال . یعنی این : PCI Express 2.0 x2 . این چیزی که گفتم پهنای
            باند 1 گیگابایت در ثانیه رو در اختیار طراحان میذاره . این در حالیه
            که ساتا نسخه سوم که دیگه بالاترین ورژن ساتا هست فقط 600 مگابایت در
            ثانیه ( یعنی 0.6 گیگابایت در ثانیه ) سرعت داره . تازه این 1 گیگابایت
            فقط واسه نسخه ی دوی پی سی آی اکسپرسه و اونم تازه با 2 تا خط انتقال .
            در حالیکه در آینده ای نزدیک ساتا اکسپرس از نسخه 3 و چهار تا خط
            انتقال استفاده می کنه که می تونه تا نزدیکای 4 گیگابایت در ثانیه هم
            بره . خیلی سرعت زیادیه . پس طراحان می تونن با افزایش تعداد خطوط
            انتقال ، پهنای باند و نهایتا سرعت انتقال اطلاعات رو در ساتا اکسپرس
            افزایش بدن .
          </p>
          <p>
            شکل زیر یه پورت ساتا اکسپرس روی مادربورد هست . همونطور که می بینید
            از 2 تا پورت ساتا به علاوه یه قسمت کوچیک تشکیل شده . این آرایش مخصوص
            روی مادربورد هست اما اون طرف که به قطعه مثل حافظه SSD وصل میشه
            متفاوته . شکل های زیر رو ببینید :
          </p>
          <img
            src={computerItem7__pic4}
            alt="
            پورت ساتا اکسپرس روی مادربورد ایسوس
            "
            data-tip="
          پورت ساتا اکسپرس روی مادربورد ایسوس
          "
          />
          <p>
            شکل زیر ، کانکتور SATA Express&nbsp;رو نشون میده که داخل پورت بالا
            میره .
          </p>
          <img
            src={computerItem7__pic5}
            alt="
            کانکتور ساتا اکسپرس سمت مادربورد
            "
            data-tip="
          کانکتور ساتا اکسپرس سمت مادربورد
          "
          />
          <p>شکل زیر&nbsp;کانکتور SATA Express هست که به حافظه SSD می خوره .</p>
          <img
            src={computerItem7__pic6}
            alt="
            کانکتور ساتا اکسپرس سمت حافظه SSD
            "
            data-tip="
          کانکتور ساتا اکسپرس سمت حافظه SSD
          "
          />
          <p>اینم عکس خود کابل ساتا اکسپرس هست :</p>
          <img src={computerItem7__pic7} alt="" data-tip="کابل ساتا اکسپرس" />
          <p>
            نهایتا اتصال یه حافظه SSD به مادربورد توسط کابل ساتا اکسپرس اینجوری
            میشه :
          </p>
          <img
            src={computerItem7__pic8}
            alt="
            حافظه SSD متصل به مادربورد
            "
            data-tip="
          حافظه SSD متصل به مادربورد
          "
          />
          <h2>NVMe در ساتا اکسپرس چیست ؟</h2>
          <p>
            بعدا شاید مفصل در مورد NVMe صحبت کنم اما در حد تیتر و اینکه کارتون
            راه بیفته بدونید که NVMe مخفف NVM Express هست و خود NVM هم مخفف
            Non-Volatile-Memory هست به معنی حافظه غیر فرار . یعنی حافظه ای که با
            رفتن برق اطلاعاتش از بین نمیره . در همین رابطه حتما پست ”{" "}
            <Link to="/computer-item-9" style={{ color: "red" }}>
              چرا با قطع برق حافظه RAM پاک میشه
            </Link>{" "}
            ” رو بخونید . پس تا همینجا میشه فهمید که NVMe مربوط به حافظه های
            بلند مدت مثل حافظه های فلش SSD هست .
          </p>
          <p>
            به زبون ساده NVMe یه پروتکل یا استاندارده و پورت به حساب نمیاد .
            ببینید ، موقعی که تکنولوژی ساتا اکسپرس طراحی شد و به بازار اومد ، یه
            جورایی باید به نرم افزار می فهموندن که آقا این حافظه SSD از تکنولوژی
            ساتا اکسپرس استفاده می کنه&nbsp;، این کار رو با طراحی یه استاندارد
            یا درایور به نام NVMe انجام دادن . الان کلیه شرکت هایی که حافظه یا
            قطعات مبتنی بر ساتا اکسپرس تولید می کنن ، بر پایه پروتکل NVMe می زنن
            که سیستم عامل ها به طور خودکار اون قطعه رو بشناسن در غیر اینصورت
            شرکت ها باید واسه قطعاتشون یه درایور مجزا می نوشتن که خب هم هزینه
            برداره و هم کار اضافه است . لازم به ذکره که قبل از تولید حافظه های
            SSD با سرعت زیاد ، حافظه ها از استاندارد AHCI استفاده می کردن .
            استاندارد NVMe اجازه سرعت بیشتر و موازی کاری بیشتری رو نسبت به{" "}
            <a href="https://en.wikipedia.org/wiki/Advanced_Host_Controller_Interface">
              AHCI{" "}
            </a>
            میده . در واقع استاندارد AHCI مخصوص تکنولوژی ساتا بود ( البته برای
            تکنولوژی PCI Express هم استفاده میشه ) اما NVMe برای تکنولوژی ساتا
            اکسپرس هست . در عکس زیر می تونید ببینید که NVMe چقدر می تونه توی
            سرعت خوندن یا نوشتن یه حافظه تاثیر گذار باشه .
          </p>
        </div>
      </Fade>
    );
  }
}

export default ComputerItem7;
