import React, { Component } from "react";
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import { mobileItem10__pic1 } from "../../../../Components/NewsImage/NewsImage";
//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews10 extends Component {
  state = {
    commentsArray: [],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <h2>شارژ گوشی و تبلت با کامپیوتر و لپ تاپ</h2>
          <p>
            شارژ کردن گوشی با کامپیوتر یا لپ تاپ مسئله ایه که خیلی ها درگیرشن ،
            خیلی ها نمی دونن که آیا این کار درسته یا نه و چه عواقبی می تونه
            داشته باشه . من در این پست می خوام در مورد یک سری ابهامات صحبت کنم
            پس با من همراه باشید .
          </p>
          <h2>شارژ گوشی با پورت USB</h2>
          <p>
            قبلا هم گفتم و الان مجدد میگم که هر ورژن از استاندارد USB هم توی برق
            رسانی و هم توی انتقال دیتا با هم فرق دارن . در همین رابطه حتما پست ”{" "}
            <Link to="/mobile-item-12">فرق ورژن و تایپ در استاندارد USB</Link>{" "}
            رو بخونید . در نسخه اول USB مقدار جریان انتقالی حدود 100 میلی آمپر ،
            در نسخه دوم یعنی USB 2.0 جریان 500 میلی آمپر و در نسخه سوم یعنی USB
            3.0 جریان 900 میلی آمپر می تونه منتقل بشه . یادتون باشه که این
            مقادیر برای پورت های معمولی USB هستن ( در ادامه توضیح میدم )
            .&nbsp;یعنی اگه یه گوشی با باتری 2700 میلی آمپر داشته باشید و به
            پورت USB 3.0 لپ تاپ یا کامپیوتر بزنید ، باتری در عرض 3 ساعت باید
            شارژ شه ( در تئوری ) . در واقع 2700 تقسیم بر 900 میلی آمپر میشه 3
            ساعت . این در حالیه که اگه شارژر استاندارد این گوشی رو که 2000 میلی
            آمپری هست به گوشی بزنید باید در عرض&nbsp;1.35 ساعت شارژ بشن ( مقادیر
            تئوری هستن و تو عمل داستان فرق میکنه ) . پس می بینید که اگه گوشی یا
            تبلت خودتون رو حتی با پورت USB 3.0 شارژ کنید ، زمان شارژ باتری زیاد
            میشه و باتری هرچی بیشتر زیر شارژ بمونه زودتر خراب میشه .
          </p>

          <p>
            لازم به ذکره که بعضی از گوشی ها حتما باید با یه مقدار استاندارد
            جریانی شارژ بشن مثلا اگه جریان کمتر از 700 میلی آمپر باشه شارژ نمیشه
            یا مثلا تو اینجور مواقع حتما باید گوشی خاموش باشه یا نمایشگرش خاموش
            باشه تا گوشی شارژ بشه.
          </p>
          <p>
            تو بعضی کامپیوتر ها یا لپ تاپ ها پورت های USB مخصوص شارژ تعبیه میشن
            که تو انگلیسی بهش میگن Dedicated USB port یعنی پورت USB اختصاصی .
            جریان خروجی پورت های اختصاصی USB حدود 2000 میلی آمپره یعنی اندازه
            شارژر یه تبلت حرفه ای . با وجود این پورت های اختصاصی خیلی راحت بدون
            هیچ دغدغه ای می تونید گوشی یا تبلت خودتون رو با کامپیوتر یا لپ تاپ
            شارژ کنید چون برای همین کار طراحی شدن !
          </p>
          <h2>شارژ گوشی با پورت USB جلوی کامپیوتر</h2>
          <img
            src={mobileItem10__pic1}
            alt=""
            data-tip="
          شارژ گوشی با کامپیوتر – پورت جلو"
          />
          <p>
            قبلا هم گفتم که پورت جلوی کامپیوتر مثل پورت پشت کامپیوتر نیست چون
            پورت USB جلوی کامپیوتر از طریق سیم به مادربورد وصل میشه و خود این
            سیمه می تونه توی مقدار ولتاژ و جریان پورت USB تاثیر گذار باشه ضمن
            اینکه احتمال اتصالی و آسیب دیدن باتری و مدارات داخلی گوشی یا تبلت
            هست . به همین دلایل ، فقط موقعی با پورت جلوی کامپیوتر گوشی تون رو
            شارژ کنید که هیچ راه حالی نمونده واستون و به بن بست روحی رسیدید !
          </p>
          <h2>خراب شدن باتری لپ تاپ و مصرف برق</h2>
          <p>
            شارژ کردن گوشی یا تبلت با لپ تاپ می تونه باعث خرابی باتری یا شارژر
            لپ تاپ بشه . دو تا حالت داره : یا شارژر به لپ تاپ وصل نیست یا شارژر
            وصله ! تو حالتی که شارژر وصل نیست باتری گوشی شما مستقیما توسط باتری
            لپ تاپ شارژ میشه و به مرور باعث خرابیباتری میشه چون باتری باید هم لپ
            تاپ رو روشن نگه داره و هم باتری گوشی شما رو شارژ کنه . این کار می
            تونه توی چرخه شارژ باتری لپ تاپ تاثیر منفی بذاره
          </p>
          <p>
            تو حالتی که شارژر به لپ تاپ وصله شارژر باید&nbsp;هم باتری لپ تاپ رو
            شارژ کنه ، هم لپ تاپ رو روشن نگه داره و هم باتری گوشی شما رو شارژ
            کنه پس هم به باتری لپ تاپ و هم به شارژر لپ تاپ به مرور آسیب وارد
            میشه .
          </p>
          <p>
            یادتون باشه معمولا تبلت ها باتری های بزرگتری دارن و جریان بیشتر می
            کشن . پس شارژ تبلت با لپ تاپ خطر بیشتری واسه لپ تاپ داره .
          </p>
          <p>
            نکته مهم بعدی اینه که شما برای شارژ کردن گوشی یا تبلت خودتون توسط
            کامپیوتر یا لپ تاپ مجبورید کامپیوتر یا لپ تاپ رو روشن نگه دارید اگه
            باتری شما 2800 میلی آمپری باشه با پورت USB 2 که 500 میلی آمپر میده
            حدود 5.6 ساعت باید کامپیوتر یا لپ تاپ رو روشن نگه دارید تا گوشی تون
            شارژ کامل بشه تازه اون 500 میلی آمپر تلفات هم داره و شاید عملا 400
            یا 300 میلی آمپر باشه . توی این مدت برق مصرف میشه ، هم پول برق
            خودتون بیشتر میشه و هم منابع انرژی کشور الکی مصرف میشه .
          </p>
          <p>
            ( البته راه هایی هست که می تونید در زمان اسلیپ یا حتی خاموش بودن لپ
            تاپ یا کامپیوتر ، باتری گوشی خودتون رو شارژ کنید که بعدا توضیح میدم
            )
          </p>
          <h2>شارژ گوشی با USB زمان تخلیه باتری رو کاهش میده&nbsp;؟</h2>
          <p>
            اینم یکی از خرافه های مرتبط با شارژ کردن گوشی هست . ببینید دوستان
            ظرفیت باتری مشخصه ، یعنی چه تو یک ساعتشارژ بشه و چه تو 10 ساعت
            نهایتا به ظرفیت مشخصی می رسه مثلا 2000 میلی آمپر . دیدم افرادی رو که
            میگن اگه گوشی رو با پورت USB کامپیوتر یا لپ تاپ شارژ کنی ، باتری دیر
            تر خالی میشه ، این مسئله هم از نظر علمی هم از نظر عملی مردوده می
            تونید امتحان کنید . تخلیه باتری به نحوه کار شما با دستگاه مربطو میشه
            ، اینکه شدت صدا چقدر باشه ، وای فای روشن باشه یا نه ، بلوتوث روشن
            باشه و …
          </p>
          <p>
            ضمن اینکه الان تکنولوژی شارژ سریع یا Quick Charge وجود داره . اگه
            بخوایم بگیم باتری هر چی زودتر شارژ بشه ماندگاری کمتری داره اونوقت
            تکنولوژی شارژ سریع رو می بریم زیر سوال !
          </p>
          <p>
            تمام شرکت ها توصیه می کنن که با شارژر استاندارد و مخصوص گوشی عمل
            شارژ رو انجام بدید و گوشی رو با پورت های غیر استاندارد شارژ نکنید .
            پورت های USB معمولی کامپیوتر و لپ تاپ برای شارژ گوشی یا تبلت طراحی
            نشدن .
          </p>
          <p>
            ضمنا اگه نمی دونید که شارژ اولیه گوشی و تبلت چیه حتما پست زیر رو
            بخونید :
          </p>
          <Link to="/mobile-item-13">شارژ اولیه گوشی و تبلت چیه ؟</Link>
          <ReactTooltip />
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews10;
