import React, { Component } from "react";
import { Fade } from "react-reveal";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  mobileItem8__pic1,
  mobileItem8__pic2,
} from "../../../../Components/NewsImage/NewsImage";
//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews8 extends Component {
  state = {
    commentsArray: [
      {
        id: "m6-1",
        name: "علی",
        comment:
          "من خودم پاور بانک دارم ، خیلی مطالب شما مفید و کاربردیه ، اگر بخوام به کسی پیشنهاد بدم چطور بخره ، حتما سایت شما رو معرفی میکنم",
      },
      {
        id: "m6-2",
        name: "آرتمیس",
        comment: "خیلی مفید بود ، تشکر",
      },
      {
        id: "m6-3",
        name: "طاهره",
        comment: "خیلی خوب توضیح دادین ، ممنون",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>فرق زوم دیجیتال و زوم اپتیکال چیست ؟</h2>
          <p>
            تفاوت زوم اپتیکال Optical Zoom با زوم دیجیتال Digital Zoom یکی از
            ابهاماتیه که خریداران دوربین عکاسی یا فیلم برداری باهاش درگیرن .
            خیلی ها شاید تا همین الان زوم اپتیکال رو با زوم دیجیتال مقایسه می
            کردن و نتیجه گیری هم می کردن . حالا واقعا چه تفاوتی بین زوم دیجیتال
            و اپتیکال وجود داره ؟
          </p>
          <h2>مقایسه زوم دیجیتال و زوم اپتیکال</h2>
          <p>
            نمی خوام خیلی تخصصی وارد بحث بشم چون الان جاش نیست پس خیلی ساده میگم
            که زوم کردن یعنی تغییر فاصله کانونی لنز دوربین نسبت به سوژه مورد نظر
            . هر چی فاصله کانونی بیشتر باشه تصویر بیشتر زوم میشه ( تصویر تِلِه
            Telephoto ) و برعکس هر چی فاصله کانونی کمتر باشه تصویر بزرگتر و باز
            تری می تونیم بگیریم ( Wide ) . دوربین های عکاسی یا فیلم برداری گرون
            قیمت و حرفه ای ، زوم اپتیکال یا زوم از طریق لنز دارن یعنی به سادگی
            با کم و زیاد کردن فاصله کانونی لنز ، تصویر رو جلو و عقب ببرید .
          </p>
          <img
            src={mobileItem8__pic1}
            alt="ax "
            data-tip="تغییر فاصله کانونی – تصویر واید و تله"
          />
          <p>
            زوم دیجیتال اصطلاحیه که با ورود دوربین های عکاسی دیجیتال به دنیای
            تکنولوژی معرفی شد . زوم دیجیتال یه کار نرم افزاریه اما زوم اپتیکال
            یه کار واقعی و سخت افزاری . زوم اپتیکال یعنی با استفاده از اهرم یا
            دکمه ای مخصوص ، فاصله کانونی رو کم و زیاد کنی اما زوم دیجیتال یعنی
            قسمتی زوم کردن روی مرکز سوژه از طریق نرم افزار .
          </p>
          <p>
            به زبان ساده ، زوم دیجیتال همون کاری رو می کنه که نرم افزار فتوشاپ
            می کنه . اگه همین الان یه عکس رو داخل فتوشاپ زوم کنید می بینید که
            کیفیت عکس به هم میریزه اما در زوم اپتیکال اتفاقی برای کیفیت تصویر
            نمیفته . به عبارت دیگه زوم دیجیتال در واقع&nbsp;زوم اپتیکال رو شبیه
            سازی می کنه .
          </p>
          <p>
            در تصویر زیر تفاوت زوم دیجیتال با زوم اپتیکال رو به وضوح می بینید :
          </p>
          <img
            src={mobileItem8__pic2}
            alt="ax"
            data-tip="فرق زوم دیجیتال و زوم اپتیکال"
          />
          <p>
            مسئله مهمی که باید در مورد زوم اپتیکال بدونید اینه که فرض
            کنید&nbsp;یه دوربین دارید با رزولوشن 15 مگاپیکسل ، عکسی که بدون زوم
            میگیرید همون 15 مگاپیکسله ، عکسی که در حالت زوم میگیرید هم همون 15
            مگاپیکسله اما در زوم دیجیتال اینجوری نیست ، عکس در حالت عادی 15
            مگاپیکسله اما وقتی زوم می کنید کیفیت یا رزولوشن میاد پایین . به زبان
            ساده و کوتاه ، زوم اپتیکال یعنی زوم با لنز اما زوم دیجیتال یعنی زوم
            نرم افزاری . خیلی ها زوم اپتیکال رو با رزولوشن مقایسه می کنن یعنی
            فکر می کنن رابطه ای بین زوم اپتیکال با رزولوشن وجود داره در حالی که
            اینجوری نیست و بالاتر گفتم که این مسئله فقط در مورد&nbsp;زوم دیجیتال
            صدق میکنه نه زوم اپتیکال .
          </p>
          <p>
            در کل مقایسه دو دوربین با تکنولوژی های مختلف اشتباهه . یعنی مقایسه
            یه دوربین با زوم اپتیکال و یه دوربین دیگه با زوم دیجیتال اشتباهه چون
            هیچ ربطی به هم ندارن . درسته جفتشون عملیات زوم رو انجام میدن اما این
            کجا و اون کجا . پس همیشه زوم اپتیکال بهتره و می تونه به عنوان یه
            معیار توی خرید دوربین عکاسی یا فیلم برداری در نظر گرفته بشه اما زوم
            دیجیتال اهمیتی نداره چون شما می تونید همون کار رو توی نرم افزار ادیت
            عکس هم انجام بدید شاید با کیفیت بهتر !
          </p>
          <p>
            نکته مهم دیگه در مورد زوم دیجیتال اینه که جدیدا شرکت های سازنده
            دوربین های دیجیتال مثل{" "}
            <a href="http://www.sony.com" target="_blank" rel="noreferrer">
              Sony{" "}
            </a>
            ، تکنولوژی جدیدی رو با عنوان زوم دیجیتال هوشمند طراحی کردن به این
            شکل که دیگه خبری از کم شدن&nbsp;کیفیت موقع زوم کردن نیست بلکه
            رزولوشن&nbsp;به نسبت مقداری که شما زوم می کنید تغییر می کنه یعنی اگه
            70 درصد زوم کنید تصویر بزرگتر نمیشه بلکه برش داده میشه و حجم کمتری
            رو اشغال می کنه . حتی با وجود این تکنولوژی هم باز زوم اپتیکال یه چیز
            دیگست و خیلی فرق میکنه .
          </p>

          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews8;
