//React
import React, { Component } from "react";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import {
  computerItem8__pic1,
  computerItem8__pic2,
  computerItem8__pic3,
  computerItem8__pic4,
  computerItem8__pic5,
  computerItem8__pic6,
  computerItem8__pic7,
  computerItem8__pic8,
} from "../../../../Components/NewsImage/NewsImage";
import ReactTooltip from "react-tooltip";
//Modules

class ComputerItem8 extends Component {
  state = {};
  render() {
    return (
      <Fade left>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>حافظه SSD چیست ، تکنولوژی درایو اس اس دی</h2>
          <p>
            حافظه SSD یکی از قطعاتی هست که اگه به سیستم اضافه بشه می تونه عملکرد
            دستگاه رو به طرز چشمگیری افزایش بده . من تو این پست می خوام بگم که
            حافظه اس اس دی&nbsp;چیه ، یعنی شما با یه سری مفاهیم اولیه در حافظه
            SSD آشنا بشید تا پست های بعدی که در مورد SSD ها می خوام بنویسم رو
            راحت تر متوجه بشید . پس با من همراه باشید .
          </p>
          <img
            src={computerItem8__pic1}
            alt="حافظه SSD اس اس دی"
            data-tip="حافظه SSD اس اس دی"
          />
          <h2>حافظه SSD اس اس دی چیست ؟</h2>
          <p>
            SSD مخفف عبارت Solid State Drive هست که تو فارسی به معنی ” درایو
            حالت جامد ” معنی شده . متاسفانه تو زبان فارسی ، معانی خیلی از
            تکنولوژی ها درست از آب در نمیاد و معمولا خنده دار میشه . حالا بگذریم
            ! حافظه SSD مبتنی بر حافظه فلش هست ، حافظه فلش همون تکنولوژی هست که
            باهاش مموری کارت ( <strong>کارت حافظه Micro SD</strong> ) و فلش
            مموری می سازن . در واقع حافظه اس اس دی&nbsp;یه جورایی یه&nbsp;فلش
            مموریه اما در ابعاد بزرگتر و حجم بیشتر . هر چند تکنولوژی ساخت حافظه
            SSD شبیه به فلش مموری هست اما کیفیت ساخت و همینطور نوع قطعاتی که
            استفاده میشه ، بین&nbsp;حافظه SSD و فلش مموری ها تفاوت ایجاد می کنه
            .
          </p>
          <img
            src={computerItem8__pic2}
            alt="
            حافظه SSD قطعه مکانیکی نداره
            "
            data-tip="
          حافظه SSD قطعه مکانیکی نداره
          "
          />
          <p>
            یکی از اشتباهات خنده داری که بین مردم اتفاق میفته اینه که میگن ”
            هارد SSD ” ! در صورتی که واژه&nbsp;هارد مختص دیسک های گردان یا HDD
            هستش . SSD نوعی از حافظه های فلش هست یعنی باید بگید حافظه SSD ، نه
            هارد SSD !
          </p>
          <p>
            حافظه SSD تقریبا اومده که جایگزین همین هاردهای معمولی HDD بشه .
            برخلاف HDD ها ، هیچ قسمت متحرکی داخل SSD وجود نداره و تماما
            الکترونیکی طراحی شده . رابط کاربری SSD ها مثل HDD همون ساتا SATA هست
            و تقریبا تو شکل و اندازه همین HDD ها طراحی میشن تا به سادگی مورد
            استفاده قرار بگیرن . البته شکل ها و رابط های مختلفی برای SSD وجود
            داره که در ادامه بهشون اشاره می کنم .
          </p>
          <img
            src={computerItem8__pic3}
            alt="حافظه SSD در ابعاد هارد HDD"
            data-tip="حافظه SSD در ابعاد هارد HDD"
          />
          <p>
            SSD بیشتر برای دستگاه های قابل حمل مثل لپ تاپ طراحی شد چون نسبت به
            هارد درایو ها&nbsp;مصرف برق کمتری دارن . هر چند این مسئله برای
            کامپیوتر های رومیزی خیلی مهم نیست اما برای لپ تاپ که از باتری
            استفاده می کنه ، حتی کوچکترین تغییر در مصرف برق ، می تونه تاثیر گذار
            باشه . ضمن اینکه حافظه اس اس دی در برابر لرزش ، ضربه و افتادن خیلی
            مقاوم تر از هارد درایو هست . حتما شنیدید که میگن هارد رو نباید تکونش
            داد ، چون قطعات مکانیکی داخل هارد ممکنه آسیب ببینن . اما در حافظه
            SSD دیگه این نگرانی وجود نداره .
          </p>
          <h2>تکنولوژی NAND و NOR در حافظه SSD</h2>
          <p>
            تو حافظه فلش و به طور کلی در حافظه SSD ما دو تا ساختار داریم . یکی
            ساختار فلش NAND و &nbsp;یکی هم ساختار فلش NOR . شرکت اینتل در سال
            1988 اولین حافظه فلش بر پایه NOR رو طراحی کرد و یک سال بعد شرکت
            توشیبا اولین حافظه فلش NAND رو ساخت . در حال حاضر در 99 درصد حافظه
            های SSD از ساختار فلش NAND استفاده می کنن اما خوبه که تفاوت بین NAND
            و NOR در حافظه SSD رو بدونید . من اینجا به صورت مقدماتی توضیح میدم
            اما تو یه پست جداگونه حرفه ای تر توضیح میدم .
          </p>
          <p>
            NAND و NOR دو تا از گیت های منطقی یا دیجیتالی هستن که با صفر و یک
            کار می کنن . با ترکیب این گیت ها با همدیگه میشه مدارات مختلفی رو
            ساخت . خود این گیت های منطقی توسط ترانزیستور طراحی میشن مثلا 2
            &nbsp;یا 3 تا ترانزیستور رو جوری طراحی می کنن که شبیه به گیت NAND یا
            NOR عمل بکنه . ساختار اون ترانزیستور ها جوریه که می تونن بار
            الکتریکی یا الکترون رو برای مدت طولانی ( مثلا چند سال ) داخل خودشون
            نگه دارن حتی اگه برق هم بهشون نرسه . پس میشه با این گیت ها حافظه فلش
            ساخت .
          </p>
          <img
            src={computerItem8__pic4}
            alt="
            ساختار حافظه SSD بر اساس NAND و NOR"
            data-tip="
          ساختار حافظه SSD بر اساس NAND و NOR"
          />
          <p>
            حالا NAND یه جور طراحی میشه و NOR هم یه جور دیگه یعنی چون از نظر
            ساختاری با هم فرق دارن ، نهایتا توی ذخیره سازی ، نوع دسترسی ، نوع
            رابط کاربری و … هم اختلاف دارن .
          </p>
          <p>
            ■ حافظه NAND می تونه فشرده باشه ، پس می تونیم حجم های بالا رو با
            NAND به سادگی طراحی کنیم .
          </p>
          <p>■ قیمت NOR گرون تر در میاد .</p>
          <p>■ NAND عمر مفید بیشتری داره .</p>
          <p>
            ■ حافظه NAND تعداد پایه های سخت افزاری کمتری نسبت به NOR نیاز داره و
            از طرفی شرکت سازنده می تونه یه فضای فیزیکی مشخص واسه حجم های مختلف
            در نظر بگیره . واسه همینه که اندازه یه فلش 2 گیگ با یه فلش مموری 32
            گیگ برابره .
          </p>
          <p>
            نهایتا نتیجه میگیریم که تکنولوژی&nbsp;NAND در حافظه SSD بسیار بهتر و
            به صرفه تر از NOR هست . از تکنولوژی NOR در موارد خاصی استفاده میشه
            که احتیاج به دسترسی تصادفی و مسائل پیچیده تر برنامه نویسی میشه که
            بعدا انشالا بیشتر توضیح میدم .&nbsp;اکثر مایکروکنترلر ها دارای حافظه
            فلش از نوع NOR هستن چون برای کدنویسی بسیار مناسبه .
          </p>
          <h2>SLC و MLC در حافظه SSD</h2>
          <p>
            بالاتر توضیح دادم که اطلاعات چجوری توی خونه های حافظه ذخیره میشه .
            اگه یه خونه یا سلول از حافظه فقط یک بیت از دیتا رو توی خودش ذخیره
            کنه میگن SLC یا&nbsp;Single-Level Cell&nbsp;هست و اگه یک&nbsp;خونه
            از حافظه 2 تا بیت یا بیشتر رو ذخیره کنه میگن MLC
            یا&nbsp;Multiple-Level Cell .
          </p>
          <img
            src={computerItem8__pic5}
            alt="
            SLC و MLC در حافظه SSD"
            data-tip="
          SLC و MLC در حافظه SSD"
          />
          <p>
            تا همینجا میشه فهمید که تکنولوژی MLC به صرفه تره چون میشه با تعداد
            ترانزیستور های کمتر ، اطلاعات بیشتری رو ذخیره کرد . اینجوری هم
            اندازه فیزیکی حافظه SSD کوچیکتر میشه و هم هزینه طراحی SSD میاد پایین
            . اما در عوض چون تو هر خونه حافظه بیشتر از یک بیت نگهداری میشه ،
            تراکم اطلاعات زیاده و همین مسئله باعث تداخل اطلاعات و بروز خطا (
            ارور ) میشه . البته با مکانیزم اصلاح خطا یا واحد Error Correction
            این خطا ها اصلاح میشن و کاربر هم هیچ وقت متوجه این خطاها نمیشه . اما
            اصلاح این خطاها زمان میگیره ، به همین دلیل حافظه اس اس دی با
            تکنولوژی MLC یه مقدار کند تر از حافظه SSD با تکنولوژی SLC هست .
            البته تکنولوژی TLC هم وجود داره&nbsp;که باید جداگونه توضیح بدم .
            سرعت TLC به مراتب کمتره و قیمتش هم پایین تره .
          </p>
          <p>
            در حال حاضر اکثر حافظه های SSD موجود در بازار از MLC استفاده کردن و
            فقط حافظه های SSD گرون قیمت و حرفه ای که برای سرورها و موارد خاص
            طراحی شدن با SLC کار می کنن . دلیل اختلاف قیمت بعضی از حافظه های SSD
            می تونه همین مسئله باشه .
          </p>
          <p>
            ■ جالب اینجاست که بعضی از سایت های معروف فارسی ( خیلی معروف ) تو
            توضیحات حافظه SSD که می خوان بفروشن ، می نویسن که : ” به دلیل وجود
            تکنولوژی MLC در این حافظه ، سرعت بسیار بالا و عمر زیاد داره ” . آدم
            واقعا خندش میگیره که از سادگی مردم چجوری سوء استفاده می کنن{" "}
          </p>
          <h2>Wear Leveling در حافظه SSD چیست ؟</h2>
          <p>
            همونطور که قبلا هم گفتم ، حافظه SSD تعداد زیادی سلول و بلاک ( Block
            ) داره که داخل شون دیتا ذخیره میشه . هر کدوم از این بلاک ها یه عمر
            مشخصی دارن یعنی می تونیم مثلا تا 5000 بار داخل این بلاک ها اطلاعات
            بنویسیم و پاک کنیم و بعد از این 5000 بار دیگه اون بلاک از حافظه می
            سوزه . توی حافظه اس اس دی بعضی از بلاک ها خیلی استفاده میشن یعنی هر
            چی میگذره ، از عمرشون کم میشه ، این درحالیه که بعضی از بلاک های
            حافظه SSD شاید 5 بار هم نوشته و پاک نشن . تکنولوژی Wear Leveling که
            توسط کنترل کننده حافظه فلش مدیریت میشه ، در واقع عدالت رو بین خونه
            های حافظه رعایت می کنه یعنی با استفاده از بلاک هایی که خیلی استفاده
            نشدن ، عمر کلی حافظه اس اس دی رو افزایش میده .&nbsp;Wear Leveling با
            متدهای مختلفی قابل اجراست که باید جداگونه توضیح بدم وگرنه سرگیجه
            میگیرید !
          </p>
          <h2>انواع حافظه SSD</h2>
          <p>
            به طور کلی حافظه SSD از نظر ظاهر در سه نوع مختلف تولید میشه . یعنی
            همشون حافظه SSD هستن اما بنا به محدودیت های فیزیکی مثل حجم ، شکل
            ظاهریشون و رابط شون فرق می کنه .
          </p>
          <h3>■ حافظه SSD استاندارد</h3>
          <p>
            اگه الان بخواین واسه کامپیوتر رومیزی تون یه حافظه SSD بخرید ، می
            بینید که شکل و اندازه ظاهری اون SSD مثل هارد های HDD هستش
            &nbsp;دلیلش اینه که باید یه جوری طراحی کنن که به سادگی جایگزین HDD
            بشه . از اونجایی که رابط هارد HDD ساتا هست ، رابط حافظه SSD مخصوص
            کامپیوتر رومیزی رو هم ساتا می زنن که به سادگی جایگزین HDD بشه .
            البته بعضی از حافظه های SSD جدید از رابط ساتا اکسپرس استفاده می کنن
            که سرعت بسیار بالایی داره . حتما پست ”{" "}
            <Link to="/computer-item-7" style={{ color: "red" }}>
              ساتا اکسپرس چیست
            </Link>{" "}
            ” رو بخونید .
          </p>
          <img
            src={computerItem8__pic6}
            alt="
            حافظه SSD با رابط ساتا اکسپرس
          "
            data-tip="
            حافظه SSD با رابط ساتا اکسپرس
          "
          />
          <h2>■ حافظه SSD با رابط m.SATA</h2>
          <p>
            m.SATA یا دقیق تر mini SATA در واقع همون رابط ساتا هست اما برای
            دستگاه های کوچک تر مثل لپ تاپ و مینی لپ تاپ ها طراحی شده . شکل ظاهری
            یکی از حافظه های SSD با رابط m.SATA رو در شکل زیر ببینید .
          </p>
          <img
            src={computerItem8__pic7}
            alt="
            حافظه SSD با رابط m.SATA ام ساتا
            "
            data-tip="
          حافظه SSD با رابط m.SATA ام ساتا
          "
          />
          <h2>■ حافظه SSD با رابط M.2</h2>
          <p>
            رابط M.2 از تکنولوژی PCI Express استفاده می کنه و می تونه خیلی
            کوچیکتر از m.SATA طراحی بشه . معمولا از M.2 در تبلت ها و آلترابوک ها
            استفاده میشه که فضا بسیار محدوده .
          </p>
          <img
            src={computerItem8__pic8}
            alt="
            مقایسه حافظه SSD از نوع M.2 و m.SATA
            "
            data-tip="
          مقایسه حافظه SSD از نوع M.2 و m.SATA
          "
          />
          <h2>مزایای حافظه SSD</h2>
          <p>■ سر و صدا نداره چون تماما الکترونیکی طراحی شده .</p>
          <p>
            ■ در برابر ضربه و لرزش مقاومه چون قطعه مکانیکی و چرخشی نداره که
            بخواد آسیب ببینه .
          </p>
          <p>
            ■ در حافظه SSD ، سرعت انتقال اطلاعات و کلا سرعت دسترسی به اطلاعات
            بسیار بالاست . سرعت بوت سیستم ، اسکن ویروس ، انتقال اطلاعات ، اجرای
            بازی و … بالا میره .
          </p>
          <p>
            ■ توان مصرفی کمی داره به همین دلیل برای استفاده در لپ تاپ ها و تبلت
            ها بسیار مناسبه .
          </p>
          <p>
            ■ حافظه SSD وزن کمتری داره و می تونه فضای کمتری رو اشغال کنه پس واسه
            دستگاه های کوچیک بسیار مناسبه .
          </p>
          <h2>معایب حافظه SSD</h2>
          <p>
            ■ قیمت بالایی دارن . البته قیمت حافظه SSD کم کم داره میاد پایین اما
            بازهم نسبت به هارد درایو ها یا همون HDD ها ، قیمت بالایی دارن .
          </p>
          <p>
            ■ حافظه SSD محدودیت نوشتن اطلاعات داره . یعنی عمر مفید مشخصی داره .
            مثلا میگن این حافظه SSD می تونه 50000 بار اطلاعات رو داخل سلول های
            خودش بنویسه و پاک کنه و بعد از اون دیگه اون سلول می سوزه .
          </p>
        </div>
      </Fade>
    );
  }
}

export default ComputerItem8;
