//React
import React, { Component } from "react";
import { Fade } from "react-reveal";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  computerItem2__pic10,
  computerItem2__pic11,
  computerItem2__pic12,
  computerItem2__pic13,
  computerItem2__pic2,
  computerItem2__pic3,
  computerItem2__pic5,
  computerItem2__pic6,
  computerItem2__pic7,
  computerItem2__pic9,
} from "../../../../Components/NewsImage/NewsImage";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class ComputerItem2 extends Component {
  state = {
    commentsArray: [
      {
        id: "c2-1",
        name: "تیمور",
        comment: "داداش واقعا لذت بردم",
      },
      {
        id: "c2-2",
        name: "رسول",
        comment: "حاجی خیلی از مشکلات من رو برطرف کرد ، دمت گرم",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <p>
            یکی از مهمترین و رو مخ ترین چیزهایی که یه لپ تاپ داره ، باتریشه !
            یعنی از اولین روزی که لپ تاپ تولید شده تا همین الان که دارید این متن
            رو می خونید ، بشریت با باتری لپ تاپ مشکل داشته . به همین دلیل میخوام
            تو این پست بهتون بگم که چجوری باتری لپ تاپ تون رو چک کنید و در واقع
            یه تست سلامت باتری لپ تاپ بگیرید پس با من همراه باشید .
          </p>
          <h2>تست سلامت باتری لپ تاپ در ویندوز 7</h2>
          <p>
            هرچند که ویندوز 7 خیلی قدیمیه و لپ تاپ های جدید هم خیلیاشون دیگه
            ویندوز 7 رو ساپورت نمی کنن اما به هر حال من تست سلامت باتری لپ تاپ
            در ویندوز 7 رو هم میگم . چون ویندوز 7 هنوووووز هم یکی از بهترین و
            سازگارترین سیستم عامل هایی هستش که مایکروسافت طراحی کرده .
          </p>
          <p>
            اول از همه باید Command Promt یا همون cmd رو باز کنید . واسه اینکار
            دو تا راه وجود داره یا دکمه های Win + R رو بزنید که Run باز بشه و تو
            کادرش بنویسید cmd و بعدش Enter رو بزنید . یا دکمه Win رو بزنید و تو
            قسمت سرچ بنویسید cmd و Enter بزنید . در هر صورت شما باید cmd رو باز
            کنید . حالا توی cmd این عبارت رو بنویسید و Enter بزنید :
          </p>
          <p>
            وقتی این عبارت رو میزنید ، تو همون CMD آدرس یه فایل HTML رو بهتون
            میده . برید به اون آدرس و فایل HTML رو باز کنید . اطلاعات مربوط به
            این فایل رو در ادامه توضیح دادم .
          </p>
          <img
            src={computerItem2__pic3}
            alt="computerItem2__pic1"
            data-tip="تست سلامت باتری لپ تاپ در ویندوز 7"
          />
          <h2>تست سلامت باتری لپ تاپ در ویندوز 8 و 10</h2>
          <p>
            توی ویندوز 8 هم مثل ویندوز 7 باید عمل کنید با این تفاوت که عبارت تست
            سلامت باتری لپ تاپ ، تغییر میکنه . توی ویندوز 7 می نوشتیم powercfg
            -energy اما توی ویندوز 8 و 10 باید بنویسیم powercfg /batteryreport .
            خب حالا cmd رو باز کنید و این عبارت رو بنویسید و Enter بزنید .
          </p>
          <p style={{ textAlign: "left" }}>powercfg /batteryreport</p>

          <img
            src={computerItem2__pic2}
            alt="computerItem2__pic1"
            data-tip="دستور تست سلامت باتری لپ تاپ ویندوز 10"
          />
          <p>
            وقتی این عبارت رو میزنید ، گزارش سلامت باتری لپ تاپ تو قالب یه فایل
            html واستون آماده میشه . توی همون cmd&nbsp;آدرس فایل html رو بهتون
            میده . شما باید به اون آدرس برید و فایل html رو باز کنید ( دوبار
            کلیک کنید خودش تو گوگل کروم یا فایرفاکس باز میشه )
          </p>
          <p>
            این فایل شامل چند تا قسمته که من تک تک قسمت ها رو بهتون توضیح میدم .
          </p>

          <img
            src={computerItem2__pic5}
            alt="computerItem2__pic1"
            data-tip="آدرس گزارش سلامت باتری لپ تاپ"
          />
          <p>
            این فایل شامل چند تا قسمته که من تک تک قسمت ها رو بهتون توضیح میدم .
          </p>
          <h3>قسمت Battery Report</h3>

          <img
            src={computerItem2__pic6}
            alt="computerItem2__pic1"
            data-tip="
      گزارش سلامت باتری در ویندوز 10
      "
          />
          <h3>قسمت installed batteries</h3>
          <img
            src={computerItem2__pic7}
            alt="computerItem2__pic1"
            data-tip="
      مشخصات باتری در تست سلامت باتری لپ تاپ
      "
          />
          <p>
            تو این قسمت اطلاعاتی در مورد خود باتری بهتون میده . name که دیگه
            میدونید اسم باتری هستش ، manufacturer هم سازنده باتریه ، سریال نامبر
            هم که مشخصه ، chemistry نوع باتری هستش که اینجا باتری لیتیوم یونه ،
            design capacity هم ظرفیتی هست که از طرف سازنده در نظر گرفته شده یعنی
            این باتری روز اول باید انقدر ظرفیت داشته باشه ! full charge capacity
            خیلی مهمه ! این میگه که الان باتری لپ تاپ شما تو حالت فول شارژ یا
            شارژ کامل ، چقدر ظرفیت داره . همونطور که تو تصویر میبینید ظرفیت
            باتری روی 44400 میلی وات ساعت طراحی شده یعنی کارخونه سازنده ، باتری
            رو جوری طراحی کرده که روز اول انقدر ظرفیت داشته باشه . اما خب باتری
            به مرور زمان ظرفیت اولیه اش رو از دست میده و همونطور که تو تصویر هم
            میبینید ، ظرفیت باتری اومده روی 37685 میلی وات ساعت ! از همین جا هم
            می تونید بفهمید که زمان تعویض باتری تون رسیده یا نه ! هر چی اختلاف
            این دو تا عدد بیشتر باشه ، یعنی باتری معیوب تر شده !
          </p>
          <p>cycle count هم تعداد سیکل شارژ باتری لپ تاپ هستش . </p>
          <h3>قسمت&nbsp;Recent Usage</h3>
          <img
            src={computerItem2__pic9}
            alt="computerItem2__pic1"
            data-tip="
      قسمت Recent Usage در تست سلامت باتری"
          />
          <p>
            تو این قسمت از تست سلامت باتری لپ تاپ ، میگه که لپ تاپ کی فعال بوده
            ، کی به برق وصل شده ، کی رفته به حالت sleep و کلا حالت های برق لپ
            تاپ رو در زمان های مختلف نشون میده ! این اطلاعات برای 3 روز اخیر در
            نظر گرفته شده ! مثلا در شکل بالا ، کاربر هی باتری رو شارژ کرده تا به
            100 درصد برسه .
          </p>
          <h3>قسمت&nbsp;Battery Usage</h3>
          <img
            src={computerItem2__pic10}
            alt="computerItem2__pic1"
            data-tip="
      گراف مصرف باتری در گزارش سلامت باتری لپ تاپ"
          />
          <p>
            این قسمت ، مصرف باتری لپ تاپ رو به صورت گراف نشون میده . این قسمت هم
            مصرف باتری توی سه روز اخیر رو نشون میده . همونطور که تو تصویر
            میبینید ، به مرور شارژ باتری کم شده .
          </p>
          <h3>قسمت&nbsp;Usage History</h3>
          <img
            src={computerItem2__pic11}
            alt="computerItem2__pic1"
            data-tip="تاریخچه مصرف باتری در گزارش سلامت باتری لپ تاپ"
          />
          <p>
            تو این قسمت میتونید بفهمید که باتری لپ تاپ تون از اولین روز کاری
            چقدر کار کرده ! در واقع نشون میده که لپ تاپ چقدر با باتری کار کرده و
            چقدر با برق شهر !
          </p>
          <h3>قسمت&nbsp;Battery Capacity History</h3>
          <img
            src={computerItem2__pic12}
            alt="computerItem2__pic1"
            data-tip="تاریخچه ظرفیت باتری در گزارش سلامت باتری لپ تاپ"
          />
          <p>
            تو این قسمت از تست سلامت باتری لپ تاپ ، می تونید ببینید که باتری شما
            به مرور زمان چقدر از ظرفیتش رو از دست داده . اعداد سمت چپ ، ظرفیت
            باتری در شارژ کامل رو نشون میده و به صورت واقعی هستش و اعداد سمت
            راست ، ظرفیت باتری به صورت ایده آله که شرکت در روز اول تولید باتری
            تعیین کرده . تو این قسمت خیلی راحت می تونید بفهمید که باتری تون کی
            باید عوض بشه . هر چی عدد سمت چپ و راست با هم اختلاف بیشتری داشته
            باشن یعنی باتری لپ تاپ تون بیشتر مستهلک شده !
          </p>
          <h3>قسمت&nbsp;Battery Life Estimates</h3>
          <img src={computerItem2__pic13} alt="computerItem2__pic1" />
          <p>
            تو این قسمت هم نشون میده که لایف تایم باتری لپ تاپ تون چقدره ! اینجا
            هم دو تا عدد وجود داره ! اعداد سمت چپ ، لایف تایم باتری رو توی حالت
            واقعی نشون میدن و اعداد سمت راست ، لایف تایم باتری رو تو حالت
            کارخونه ای نشون میدن یعنی جوری که باتری طراحی شده تا اون لایف تایم
            رو داشته باشه ! تو این قسمت میتونید ببینید که باتری تون از نظر زمانی
            نسبت به زمان تولید چقدر افت داشته . یعنی چقدر کمتر شارژ نگه میداره !
          </p>
          <p>
            نکته آخر اینکه این دستور برای کامپیوتر رومیزی اجرا نمیشه چون باتری
            نداره و با برق کار میکنه .
          </p>
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default ComputerItem2;
