//React
import React, { Component } from "react";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
import ReactTooltip from "react-tooltip";
import {
  mobileItem2__pic1,
  mobileItem2__pic2,
  mobileItem2__pic3,
  mobileItem2__pic4,
  mobileItem2__pic5,
  mobileItem2__pic6,
} from "../../../../Components/NewsImage/NewsImage";
import Comments from "../../../../Components/Comments/Comments";
import { Fade } from "react-reveal";
//Modules

class MobileNews2 extends Component {
  state = {};
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade left>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>جک هدفون چیست ؟ معنی جک 3.5 میلی متری</h2>
          <p>
            حتما تو مشخصات فنی لپ تاپ ها و یا گوشی های موبایل عبارت جک هدفون
            زیاد به چشم تون خورده باشه اما این جک هدفون دقیقا چیه و چرا روی
            وسایل الکترونیکی وجود داره ؟ تو این پست خیلی کوتاه و مفید بهتون
            توضیح میدم پس با من همراه باشید !
          </p>
          <h2>جک هدفون چیست ؟</h2>
          <p>
            قبل از هر چیزی باید بگم که جک چیه ؟ جک به انگلیسی Jack اسم دیگه ای
            برای سوکت هستش . ورودی هدفون رو میگن جک هدفون . عکس زیر رو ببینید ،
            روی همه مادربورد ها این ورودی های رنگی منگی رو باید دیده باشید !
            اینا همشون جک یا سوکت ورودی و خروجی صوتی مثل هدفون یا میکروفون هستن
            .
          </p>
          <img
            src={mobileItem2__pic3}
            data-tip="جک های پشت کیس"
            alt="جک های پشت کیس"
          />
          <p>
            واسه اینکه هدفون رو به این جک وصل کنیم احتیاج به یه فیش یا کانکتور
            داریم دیگه ! به کانکتور این جک ، یا چیزی که داخل این جک میشه میگن
            Plug یا Connector و تو فارسی ما میگیم فیش و یا کانکتور . تو شکل زیر
            پین های یه دونه از ین کانکتور ها رو واستون مشخص کردم . این فیش یا
            کانکتور یه هدست هستش یعنی هدفونی که میکروفون هم داره .
          </p>
          <img
            src={mobileItem2__pic1}
            data-tip="فیش هدفون ( هدست )"
            alt="
        فیش هدفون ( هدست )"
          />
          <p>
            این فیش صدا ، سه و یا 4 تا پین داره ، یکی برای صدای چپ ، یکی برای
            صدای راست و یکی هم بین چپ و راست مشترک . فیش هایی که 4 تا پین دارن
            در واقع میکروفون هم بهشون وصل میشه . به عبارت دیگه فیش هدفون ، سه تا
            پین داره اما فیش هدست ( هدفونِ میگروفن دار ) چهارتا پین داره .
          </p>
          <img
            src={mobileItem2__pic2}
            data-tip="مقایسه فیش هدفون و فیش هدست"
            alt="مقایسه فیش هدفون و فیش هدست"
          />
          <p>
            جک هدفون روی بیشتر وسایل الکترونیکی وجود داره چون کاربر باید بتونه
            هدفونش رو به اون وصل کنه و موسیقی گوش کنه .
          </p>
          <p>تصویر زیر ، جک 3.5 میلی متری رو روی لپ تاپ نشون میده .</p>
          <img
            src={mobileItem2__pic4}
            data-tip="جک 3.5 روی لپتاپ"
            alt="جک 3.5 روی لپتاپ"
          />
          <p>تصویر زیر ، جک 3.5 میلی متری رو روی گوشی موبایل نشون میده .</p>
          <img
            src={mobileItem2__pic5}
            data-tip="جک 3.5 روی گوشی"
            alt="جک 3.5 روی گوشی"
          />
          <h2>جک 3.5 میلی متری چیست ؟</h2>
          <p>
            حتما تو مشخصات فنی لپ تاپ ها یا گوشی های موبایل عبارت جک هدفون 3.5
            میلی متری رو زیاد دیدین ! اما این عدد از کجا میاد ؟ منظور از جک 3.5
            میلی متری اینه که قطر سوراخ این جک 3.5 میلی متره ، چرا چون قطر اون
            قسمت گرد فیش ، 3.5 میلی متره ( تصویر زیرو ببینید ) . یه مدل دیگه از
            کانکتور صوتی هست که به فیش 2.5 میلی متری معروفه چون قطر اون قسمت
            گردش ، 2.5 میلی متره . عکس زیر رو ببینید قشنگ متوجه میشید :
          </p>
          <img
            src={mobileItem2__pic6}
            alt="
        مقایسه سایز کانکتور صدا 3.5 میلی متری و 2.5 میلی متری"
            data-tip="مقایسه سایز کانکتور صدا 3.5 میلی متری و 2.5 میلی متری"
          />
          <p>
            در تصویر بالا ، فیش سمت چپی یه فیش 2.5 میلی متری و دو تای سمت راستیش
            فیش های 3.5 میلی متری هستن و سمت راستی هم فیش 6.35 میلی متریه !
          </p>
          <Comments commentsArray={this.state.commentsArray || []} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews2;
