//React
import React, { Component } from "react"; //React
import { Fade } from "react-reveal";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  computerItem6__pic1,
  computerItem6__pic2,
  computerItem6__pic3,
  computerItem6__pic4,
} from "../../../../Components/NewsImage/NewsImage";
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class ComputerItem6 extends Component {
  state = {
    commentsArray: [
      {
        id: "c5-1",
        name: "آرتا",
        comment: "  داداش میخواستم باتری بخرم ، خیلی کمکم کردی ، دمت گرم ",
      },
      {
        id: "c5-2",
        name: "هلیا",
        comment: " خیلی مفید بود ، ممنون از مجله ی سیاه و سفید",
      },
    ],
  };
  render() {
    return (
      <Fade left>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>باتری 6 سلولی لپ تاپ با باتری 4 سلولی چه فرقی دارد ؟</h2>
          <p>
            همونطور که می دونید باتری &nbsp;وظیفه تامین انرژی رو برای قطعات
            الکترونیکی داره . در واقع اختلاف پتانسیل حاصله از باتری باعث ایجاد
            جریان و حرکت اون تو مدار میشه . دوستانی که کمی علم
            <a href="http://en.wikipedia.org/wiki/Electronics">الکترونیک </a>
            دارن می دونن که در مدارات الکترونیکی اگه یه منبع ولتاژ داشته باشیم و
            چندین قطعه مثل مقاومت به صورت سری در مدار باشن ، ولتاژ کل که همون
            منبع تغذیه هست بین این قطعات به نسبت اندازه مقاومت ( اهم ) تقسیم
            میشه و جریان یکسانی از آنها می گذره و بر عکس اگر همون مدار رو به
            صورت موازی در نظر بگیریم جریان کل بین هر شاخه موازی به نسبت اندازه
            مقاومت ( اهم ) تقسیم میشه و ولتاژ همه اونها یکی هست .
          </p>
          <h2>سری بستن باتری ها</h2>
          <p>
            حال اگر چند منبع تغذیه ( باتری ) رو به صورت سری با هم در مدار قرار
            دهیم ، ولتاژ اونا با هم جمع میشه . حتما باتری قلمی رو داخل کنترل
            تلویزیون یا ساعت دیواری و … قرار دادید . اگه دقت کرده باشید جهت یکی
            از باتری ها بر عکس دیگری است . این بدین دلیله که باید سر مثبت یه
            باتری به سر منفی اون یکی باتری بخوره تا مقدارشون با هم جمع بشه . مثل
            شکل زیر :
          </p>
          <img
            src={computerItem6__pic1}
            alt="باتری ها در حالت سری بسته شده اند"
            data-tip="باتری ها در حالت سری بسته شده اند"
          />
          <p>
            اگر به شکل بالا دقت کنید ، در حالت سری ، ولتاژ باتری ها با همدیگه
            جمع میشه اما جریان یکسانی از اونا عبور می کنه .
          </p>
          <h2>موازی بستن باتری&nbsp;ها</h2>
          <p>
            در حالت موازی باتری ها دارای ولتاژی یکسان هستند اما جریان شاخه ها با
            هم جمع می شود . شکل زیر :
          </p>
          <img
            src={computerItem6__pic2}
            alt="باتری ها در حالت موازی"
            data-tip="باتری ها در حالت موازی"
          />
          <p>
            پس تا اینجا با سری بستن باتری ها به ولتاژ بیشتر و با موازی بستن اونا
            به جریان بیشتر رسیدیم . حالا اگه بخوایم هم به ولتاژ بیشتر و هم به
            جریان بیشتر برسیم باید از ترکیب سری – موازی ( اتصال مختلط ) استفاده
            کنیم .در لپ تاپ ها برای اینکه به جریان و ولتاژ مطلوب برسن نیز از
            همین روش استفاده میشه . شکل زیر :
          </p>
          <img
            src={computerItem6__pic3}
            alt="اتصال سری – موازی باتری ها"
            data-tip="اتصال سری – موازی باتری ها"
          />
          <p>
            همونطور که می بینید ۲ تا باتری ۱.۲ ولتی با هم سری شدند و با ۲ تا
            باتری ۱.۲ ولتی سری دیگه ، موازی شدند . با این کار در خروجی به ۲.۴
            ولت و ۲۰۰۰ میلی آمپر می رسیم .
          </p>
          <p>
            داستان ۳ ، ۶ ، ۹ یا ۱۲ سلولی نیز از همین جا شروع میشه . در واقع به
            هر کدوم از این باتری ها یک سلول میگن . ۶ سلولی یعنی ۶ تا باتری شبیه
            به باتری های قلمی درون یک بسته بندی جا خوش کردند . البته باتری قلمی
            با باتری های مورد استفاده در لپ تاپ زمین تا آسمون فرق میکنه اما
            اینجوری گفتم که درکش راحت تر بشه .
          </p>
          <p>
            باتری های لپ تاپ ولتاژی بین ۳.۷ تا ۴ ولت دارن و جریانی حدود ۲۲۰۰
            میلی آمپر یا در واقع ۲.۲ آمپر جاری می کنند . برای باتری های ۶ سلولی
            ، ۳ عدد سلول ( باتری ) سری بسته می شن . ۳ تا دیگه هم سری بسته
            میشن&nbsp; و در اخر این جفت ۳ باتری با هم موازی میشن تا به ولتاژ و
            جریان مورد نظر برسیم .
          </p>
          <h2>تفاوت باتری ۶ سلولی با باتری ۴ سلولی</h2>
          <p>
            تا اینجا متوجه شدید که اتصالات مختلف باتری ها می تونه مقادیر مختلفی
            از جریان و ولتاژ رو به ما بده . توان الکتریکی یعنی همون مقداری که
            میگن باتری می تونه تولید کنه تا لپ تاپ روشن شه و روشن بمونه از ضرب
            ولتاژ باتری در جریان باتری بدست میاد .
          </p>
          <p>توان = ولتاژ * جریان</p>
          <p>
            حالا هر چی این سلول ها ی باتری لپ تاپ بیشتر باشن ، ولتاژ و جریان
            بیشتری تولید می کنن پس در نتیجه توان بیشتری نیز دارند . البته همیشه
            اینجور نیست . این نکته خیلی مهمه : شاید سلول های یک باتری های ۶
            سلولی جریان ۲ آمپر را تولید کنند و سلول های باتری ۴ سلولی جریان ۲.۴
            آمپر . اما توان باتری ۶ سلولی بیشتره . چرا ؟ چون توان حاصلضرب ولتاژ
            در جریانه . طبیعتا ولتاژ باتری ۶ سلولی به دلیل اینکه ۲ سلول بیشتر از
            باتری ۴ سلولی داره در کل بیشتره . پس توان بیشتری هم تولید می کنه .
            این توان رو بر اساس وات ساعت بیان می کنن . یعنی در هر ساعت می تونه
            فلان وات به مدار بده .
          </p>
          <p>
            برای روشن تر شدن قضیه باید بگم که معمولا باتری های ۶ سلولی با جریان
            ۲.۲ آمپر ، ۴۸ وات ساعت و باتری های ۶ سلولی ظرفیت بالا با جریان ۲.۵۵
            آمپر ، ۵۴ وات ساعت توان تولید می کنن . از طرفی باتری های ۹ سلولی با
            جریان ۲ آمپر ، ۹۴ وات ساعت تولید میکنن . فکرع کنم الان دیگه داستان
            این وات ساعت رو متوجه شده باشید . شایدم نه . الان شاید بگید چطو این
            باتری ۹ سلولیه با ۲ آمپر توان بیشتری از باتری ۶ سلولی با ۲.۵۵ آمپر
            تولید کرد ؟ جواب رو پاراگراف بالا دادم : به خاطر تعداد سلول بیشتر و
            در نتیجه ولتاژ بیشتر.
          </p>
          <p>
            در مورد باتری ۴ سلولی هم همینه . باتری ۴ سلولی از باتری ۶ سلولی وزن
            کمتری داره اما شاید حجم یکسانی داشته باشه . توان کمتری هم نسبت به
            باتری ۶ سلولی تولید می کنه . نکته مهم اینه که الزاما باتری ۶ سلولی
            طول عمر بیشتری از باتری ۴ سلولی نداره . شاید شما باتری ۶ سلولی داشته
            باشی اما از صبح تا شب با لپ تاپ کار کنی . یا شاید نرم افزارهایی رو
            باز کنی که RAM و گرافیک و پردازنده لپ تاپ شما بیشتر توان مصرف کنن .
            یا شاید از DVD رایتر خودتون زیاد استفاده میکنید و هزار و یک کار دیگه
            .
          </p>
          <img
            src={computerItem6__pic4}
            alt="باتری ۶ سلولی"
            data-tip="باتری ۶ سلولی"
          />
          <h2>خلاصه مقایسه باتری ۶ سلولی با باتری ۴ سلولی :</h2>
          <p>باتری ۶ سلولی وزن بیشتری نسبت به باتری ۴ سلولی داره .</p>
          <p>حجم باتری ۴ سلولی شاید برابر با باتری ۶ سلولی باشه .</p>
          <p>طول عمر باتری ۶ سلولی از باتری ۴ سلولی بیشتره .</p>
          <p>قیمت باتری های ۶ سلولی به دلیل وجود سلول بیشتر ، گرون تره .</p>
          <p>
            بسته به نیاز و کارکرد کاربر ، باتری ۴ سلولی می تونه حتی طول عمر
            بیشتری از ۶ سلولی داشته باشه .
          </p>
          <p>
            هرچه تعداد سلول های یک باتری بیشتر باشه ، توان اون بیشتر و مدت زمان
            بیشتری می تونه لپ تاپ رو روشن نگه داره .
          </p>
          <p>
            البته یه نکته کنکوری رو هم بگم ! همیشه تعداد بیشتر سلول ، دلیل بر
            توان بیشتر نیست چون بستگی به توان اون سلول هم داره . یه باتری میتونه
            4 سلولی باشه اما از یه باتری 6 سلولی قوی تر باشه . چون هر سلول رو
            قوی تر ساختن . اما تو شرایط برابر قطعا اون باتری ای که سلول های
            بیشتری داره ، قوی تره .
          </p>
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default ComputerItem6;
