import React, { Component } from "react";
import { Fade } from "react-reveal";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  mobileItem9__pic1,
  mobileItem9__pic1 as mobileItem9__pic4,
  mobileItem9__pic2,
  mobileItem9__pic3,
  mobileItem9__pic5,
  mobileItem9__pic6,
} from "../../../../Components/NewsImage/NewsImage";
//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews9 extends Component {
  state = {
    commentsArray: [],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>فلت گوشی چیست ؟ کاربرد و انواع کابل فلت</h2>
          <p>
            اگه صفحه نمایش گوشی تون ایراد پیدا کرده باشه و اونو به تعمیرگاه برده
            باشید ، احتمال خیلی زیاد عبارت ” فلت گوشی ” به گوشتون خورده ! تا
            میگی نمایشگر گوشیم پر پر میزنه یا روشن نمیشه یا … سریع میگه مشکل از
            فلت گوشیه !
          </p>
          <p>
            اما این فلت گوشی چیه و اصن کجای گوشیه و کاربردش چیه ؟ با من همراه
            باشید !
          </p>
          <h2>کابل فلت چیه ؟</h2>
          <p>
            واژه فلت به انگلیسی Flat یعنی مسطح . پس تا اینجا کابل فلت باید یه
            کابلی باشه که مسطح یا خیلی باریکه !
          </p>
          <p>
            جالبه بدونید که عبارت کامل کابل فلت در انگلیسی اینه : Flexible Flat
            Cable یعنی کابل مسطح انعطاف پذیر ! که به اختصار بهش Flex Cable یا
            بعض مواقع Flat Cable میگن یعنی جفتش درسته و اگه یکی از اینا رو بگین
            طرف مقابل منظورتونو میفهمه !
          </p>
          <img
            src={mobileItem9__pic1}
            alt="ax"
            data-tip="
          کابل فلت
          "
          />
          <p>
            دو طرف کابل فلت لخت هستش یعنی سیم مسی مشخصه . دو طرف کابل وارد یه
            سوکت میشه که اتصال برقرار بشه . مثلا در شکل زیر میبینید که کابل سمت
            چپی لخته و هنوز داخل سوکت نرفته و کابل سمت راستی وارد سوکت شده . خود
            اون سوکت هم از زیر به بورد وصله و اینجوری اتصال برقرار میشه .
          </p>
          <img
            src={mobileItem9__pic2}
            alt="ax"
            data-tip="
          سوکت کابل فلت
          "
          />
          <h2>کاربرد کابل فلت چیه ؟</h2>
          <p>
            قبلا که تکنولوژی انقدر پیشرفت نکرده بود ، سایز قطعات و وسایل
            الکترونیکی اهمیت خیلی زیادی نداشت اما به مرور زمان و مخصوصا بعد از
            معرفی گوشی موبایل ، طراحان فهمیدن که گوشی موبایل نباید انقدر بزرگ
            باشه تا کاربر بتونه خیلی راحت باهاش کار کنه . از همون روزا قطعات هی
            کوچیکتر شدن . خب این قطعات باید یه جوری به همدیگه وصل بشن دیگه !
            قطعات با مدار مسی و یا سیم به هم وصل میشن . این سیم ها قبلا ضخیم و
            حجیم بودن که هم&nbsp; جای بیشتری میگرفتن و هم هزینه تولید رو بالا
            میبردن !
          </p>
          <p>
            با طراحی سیم های خیلی باریک ، هم فضای کمتری اشغال میشد و هم هزینه
            تولید ( سیم مسی گرونه ! ) اومد پایین . جدای هزینه ، اگه چیزی به نام
            کابل فلت وجود نداشت ، اصلا گوشی های موبایل و لپ تاپ نمیتونستن انقدر
            کوچیک ، باریک و جمع و جور طراحی بشن . کابل فلت سبکه ، فضای کمی
            میگیره ، انعطاف داره و پیچ میخوره و نهایتا هزینه کمتری برای تولید
            کننده داره !
          </p>
          <img
            src={mobileItem9__pic3}
            alt="ax"
            data-tip="کابل فلت گوشی موبایل"
          />
          <h2>کابل فلت نواری</h2>
          <p>
            یه مدل کابل فلت یا مسطح دیگه هم وجود داره که تو ایران به اونم میگن
            فلت ( دقیق تر فلت نواری ) و تو انگلیسی بهش میگن Ribbon Cable . این
            کابل نواری از چند سیم ضخیم تر نسبت به کابل فلت تشکیل شده . گفتم
            بدونید که همچین کابلی هم وجود داره و بهش میگن کایل فلت نواری . الان
            دیگه کابل IDE هارد منقرض شده و به جاش کابل ساتا اومده اما کابل فلت
            نواری همون کابل هایی بود که برای اتصال هارد به مادربورد کامپیوتر
            استفاده میشد .&nbsp;عکسش رو ببینید :
          </p>
          <img src={mobileItem9__pic4} alt="ax" data-tip="کابل فلت نواری" />
          <h2>کابل فلت گوشی و لپ تاپ</h2>
          <p>
            منظور از فلت گوشی همون کابل فلت گوشی هستش ! کابلی که صفحه نمایش گوشی
            رو به مادربورد گوشی وصل میکنه و یا صفحه لمسی ( تاچ ) رو به بورد گوشی
            وصل میکنه ! کابل فلت گوشی بخاطر کوچیک و ظریف بودن ، خیلی آسیب پذیره
            !
          </p>
          <img
            src={mobileItem9__pic5}
            alt="ax"
            data-tip="کابل فلت گوشی آیفون"
          />
          <p>
            مثلا تو تصویر بالا فلت گوشی آیفون رو میبینید که نمایشگر رو به بورد
            اصلی وصل کرده .
          </p>
          <p>
            این کابل فلت دو تا سر داره که یکیش به نمایشگر و یکیش به بورد وصل
            میشه . بعضی وقتا بخاطر ضرباتی که به گوشی میخوره ممکنه این کابل از
            جاش دربیاد و یا پارگی جزئی پیدا بکنه . به همین دلیل باعث میشه
            نمایشگر گوشی تون پر پر بزنه و یا درست خاموش و روشن نشه ! با تعویض
            کابل فلت گوشی احتمالا این مشکلات برطرف بشه . یعنی اگه شما گوشیتونو
            ببرید تعمیرگاه و بگین که نمایشگرش مشکل داره ، تعمیرکار اول از همه
            کابل فلت گوشی رو تست میکنه و اگه از کابل فلت مطمئن شد میره سراغ بقیه
            قسمت ها .
          </p>
          <p>
            در مورد لپ تاپ هم همینطوره ، کیبورد ، نمایشگر ، برخی ماژول ها داخل
            لپ تاپ با استفاده از کابل فلت به مادربورد لپ تاپ وصل میشن .
          </p>
          <img src={mobileItem9__pic6} alt="ax" data-tip="کابل فلت در لپ تاپ" />
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews9;
