//React
import React, { Component } from "react";
import { Fade } from "react-reveal";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  computerItem1__pic1,
  computerItem1__pic2,
  computerItem1__pic3,
  computerItem1__pic4,
  computerItem1__pic5,
  computerItem1__pic6,
} from "../../../../Components/NewsImage/NewsImage";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class ComputerItem1Page extends Component {
  state = {
    comments: [
      { id: "c1-1", name: "علی", comment: "عالیه" },
      {
        id: "c1-2",
        name: "محمد رضا",
        comment: "خیلی خوب توضیح دادین ، ممنون از توضیح روان و ساده ی شما .",
      },
      {
        id: "c1-3",
        name: "نگار",
        comment: "ممنون از اطلاعات مفیدی که در اختیار ما قرار میدین",
      },
    ],
  };
  componentDidMount() {
    // if (window.innerWidth > 1900) {
    // window.scrollY = 60;
    // window.scrollTo({ top: });
    // } else if (window.innerWidth > 1300) {
    //   window.scrollTo({ top: 250 });
    // } else if (window.innerWidth < 500) {
    //   window.scrollTo({ top: 140 });

    // }

    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip
            afterShow={() => {
              setTimeout(ReactTooltip.hide, 10);
            }}
          />
          <p>
            تبلت هیبریدی یکی از محصولات پیوند زده دنیای تکنولوژی هستش . پیوندی
            بین لپ تاپ و تبلت . تو این پست میخوام مشخصات ظاهری و فنی تبلت ها یا
            لپ تاپ های هیبریدی رو بهتون بگم پس با من همراه باشید .
          </p>
          <h2>تبلت هیبریدی چیست ؟</h2>
          <p>
            قبل از هر چیزی باید بگم که واژه هیبرید از انگلیسی میاد با املای
            Hybrid . تلفظ درست واژه Hybrid در انگلیسی به این شکله : هایبرید .
            اما تو ایران به صورت هیبرید دیگه جا افتاده ! میگن ماشین هیبریدی یا
            تبلت هیبریدی .
          </p>
          <img
            data-tip="تبلت هیبریدی لمسی"
            src={computerItem1__pic1}
            alt="تبلت هیبریدی لمسی"
          />
          <p>
            بعد از معرفی ویندوز 8 و اون کاشی های معروفش ، نیاز به تبلت هیبریدی
            یا لپ تاپ تبدیل شونده بیشتر حس شد . ویندوز 8 جوری طراحی شده بود که
            با صفحه نمایش تاچ یا لمسی سازگار باشه . حقیقت این بود که تبلت یه
            محصول بلاتکلیف بین گوشی و تبلت بود . تبلت باید یه جوری یا حذف میشد
            یا زورکی هم که شده به حیات خودش ادامه میداد ! چون خیلی از کاربرا
            دقیقا نمیدونستن که داشتن یه تبلت مثلا 10 اینچی به چه کارشون میاد .
            تبلت های کوچیکتر هم که با گوشی ها ادغام شدن . پس باید یه محصول جدید
            درست میشد . اینجوری شد که تبلت هیبریدی بوجود اومد !
          </p>
          <p>
            به زبون ساده ، تبلت هیبریدی تبلتیه که به لپ تاپ هم تبدیل میشه . در
            واقع دو منظوره طراحی شده که شما در آن واحد هم تبلت داشته باشید و هم
            لپ تاپ . پس به تبلت هیبریدی لپ تاپ هیبریدی هم میگن خیلی فرقی نمیکنه
            !{" "}
            <span>
              من تو این مقاله هرجا گفتم تبلت یا لپ تاپ هیبریدی و یا لپ تاپ تبدیل
              شونده ، بدونید که فرقی نمیکنه .
            </span>
          </p>
          <p>
            تو انگلیسی به این مدل تبلت ها و یا لپ تاپ ها میگن 2in1 PC یعنی
            کامپیوتر شخصی ای که هم تبلته و هم لپ تاپ . البته یه چیز دیگه هم میگن
            اونم Convertible Laptop هستش یعنی همون لپ تاپ تبدیل شونده یا لپ تاپ
            تبدیل پذیر به تبلت .
          </p>
          <h2>کاربرد تبلت هیبریدی ، به درد کی میخوره ؟</h2>
          <p>
            تبلت های هیبریدی واسه این طراحی شدن که قابلیت حمل و سبکی یه تبلت رو
            داشته باشن اما در عین حال قدرت پردازش یه لپ تاپ رو هم داشته باشن !
            به همین دلیل تبلت هیبریدی یا لپ تاپ تبدیل شونده واسه چند دسته از
            افراد ، گزینه مناسبیه .
          </p>
          <p>
            ■ یکی بیزنس من ها و کلا کسایی که برای ارائه کار و بیزنس خودشون
            احتیاج به تبلت یا لپ تاپ دارن ، یا مثلا حساب کتاب کاری روزمره شون رو
            میخوان انجام بدن .
          </p>
          <p>
            ■ دانش آموزا یا دانشجوها میتونن هم برای سرگرمی و هم برای خوندن
            مقالات و اجرای پروژه های درسی شون از لپ تاپ تبدیل شونده استفاده کنن
            .
          </p>
          <p>
            ■ افرادی که سفر زیاد میرن قطعا به یه تبلت هیبریدی نیاز دارن چون هم
            میتونن باهاش مثل یه تبلت با صفحه لمسی بازی کنن و هم اینکه عکس و
            فیلماشونو بریزن تو تبلت ، فیلم ببینن ، کتاب بخونن ، موسیقی گوش بدن و
            …
          </p>
          <h2>ویژگی های تبلت های هیبریدی</h2>
          <p>
            تبلت های هیبریدی چندتا ویژگی بارز دارن که موقع خرید باید حواستون
            بهشون باشه :
          </p>
          <p>
            ■ لپ تاپ های تبدیل شونده پردازنده های کم توان دارن پردازنده هایی که
            مخصوص کاربری موبایل طراحی شدن . حتی اگه پردازنده core i7 هم داشته
            باشن ، از سری U هستن که توان کمی مصرف میکنن . این مسئله بخاطر اینه
            که توی این تبلت ها نمیشه فن خنک کننده مناسب برای پردازنده قوی طراحی
            کرد ، چون جا نیست !
          </p>
          <p>
            ■ لپ تاپ های تبدیل شونده معمولا گرافیک مستقل ندارن و از پردازنده
            گرافیکی که روی خود پردازنده هست استفاده میکنن ، به همین دلیل
            نمیتونید باهاشون بازی سنگین یا حتی نیمه سنگین اجرا کنید و یا ادیت
            فیلم و تصویر و کارهای سنگین !
          </p>
          <p>
            ■ تبلت هیبریدی معمولا فن خنک کننده نداره چون باریک طراحی میشه . تو
            این تبلت ها یا از پردازنده های کم مصرف استفاده میکنن که گرمای زیادی
            تولید نکنه و یا از سیستم خنک کننده مایع استفاده میکنن !
          </p>
          <p>
            ■ لپ تاپ های تبدیل شونده صفحه نمایش لمسی دارن که معمولا رزولوشن فول
            اچ دی دارن ، هرچند که مدل های ارزون هم پیدا میشن که کیفیت HD دارن
            اما اون مدلایی که شرکتهای معروف تولید میکنن حداقل رزولوشن 1920 در
            1080 رو دارن .
          </p>
          <p>
            ■ سایز صفحه نمایش تبلت هیبریدی بستگی به شرکت سازنده و کاربرد اون
            تبلت داره اما معمولا اینجور تبلت ها بین 11 تا 15 اینچ هستن .
          </p>
          <h2>انواع تبلت های هیبریدی</h2>
          <p>به طور کلی دو نوع تبلت یا لپ تاپ هیبریدی داریم !</p>
          <p>
            ■ تبلتی که کیبوردش ازش جدا میشه که بهش میگن Detachable Tablet . این
            نوع ، واسه اونایی مناسبه که بیشتر قابلیت تبلت بودن واسشون مهمه و
            میخوان با وزن کم و به راحتی با تبلت کار کنن .
          </p>
          <img
            data-tip="لپتاپ هیبریدی"
            src={computerItem1__pic2}
            alt="لپتاپ هیبریدی"
          />
          <p>
            ■ تبلت یا لپ تاپی که کیبوردش جدا نمیشه اما برمیگرده . این مدل برای
            افرادی مناسبه که بیشتر قابلیت لپ تاپ بودن واسشون مهمه چون معمولا این
            مدل تبلت های هیبریدی ، پورت های بیشتر و کیبورد های بهتری دارن .
          </p>
          <img
            data-tip="لپتاپ هیبریدی تاشو"
            src={computerItem1__pic3}
            alt="لپتاپ هیبریدی تاشو  "
          />
          <h2>قیمت تبلت هیبریدی</h2>
          <p>
            الان که دارم این مقاله رو مینویسم قیمت تبلت های هیبریدی درست حسابی
            تو بازار جهانی بین 700 تا 1400 یورو هستش که اگه بیاد ایران باید
            ضربدر قیمت یورو بکنید و سود وارد کننده ، دلال و فروشنده رو هم حساب
            کنید . یه تبلت مناسب الان حداقل 12 تا 14 میلیون تومن آب میخوره .
          </p>
          <h2>تبلت های هیبریدی بازار</h2>
          <p>
            شرکت های Dell ، مایکروسافت ، سامسونگ ، ایسوس ، لنوو و HP شش تا شرکت
            معتبر در زمینه طراحی و تولید لپ تاپ های هیبریدی هستن . همین چند وقت
            پیش سامسونگ از تبلت/لپ تاپ 12 اینچی خودش به اسم گلکسی بوک اس رونمایی
            کرد . صفحه نمایش 13.3 اینچی ، رم 8 گیگ ، حافظه اس اس دی تا 512
            گیگابایت ، پردازنده اسنپدراگون 8cx و باتری 42 وات ساعتی داره .
          </p>
          <img
            src={computerItem1__pic4}
            data-tip="لپ تاپ هیبریدی سامسونگ گلکسی بوک اس"
            alt="لپتاپ هیبریدی تاشو"
          />
          <p>
            تبلت هیبریدی سرفیس پرو شرکت مایکروسافت هم یکی دیگه از تبلت های حرفه
            ای و البته گرون قیمت هستش . تا الان آخرین مدلی که از این سری معرفی
            شده مدل سرفیس پرو 7 و همینطور سرفیس پرو اکس هستش . سرفیس پرو 7 از
            750 دلار و سرفیس پرو اکس از 1000 دلار قیمت گذاری شدن .
          </p>
          <img
            src={computerItem1__pic5}
            data-tip="تبلت هیبریدی سرفیس پرو 7"
            alt=""
          />
          <p>
            تبلت لپ تاپ هیبریدی دل XPS 13 که یکی از جدیدترین لپ تاپ های هیبریدی
            بازاره . پردازنده Core i3 و یا core i5 و یا core i7 داره . رم تا 32
            گیگ ساپورت میکنه ، حافظه تا 1 ترابایت اس اس دی و نمایشگر 13.4 اینچی
            داره .
          </p>
          <img
            src={computerItem1__pic6}
            data-tip="تبلت هیبریدی دل xps 13"
            alt=""
          />
          <p>
            مدل های بیشتری در بازار وجود دارن و من فقط خواستم چندتا نمونه معرفی
            کنم که شما بدونید اصن این تبلت های هیبریدی چه شکلین و چه مشخصاتی
            دارن .
          </p>
          <Comments commentsArray={this.state.comments} />
        </div>
      </Fade>
    );
  }
}

export default ComputerItem1Page;
