import React, { Component } from "react";
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  mobileItem7__pic1,
  mobileItem7__pic2,
  mobileItem7__pic3,
} from "../../../../Components/NewsImage/NewsImage";
//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews7 extends Component {
  state = {
    commentsArray: [
      {
        id: "m6-1",
        name: "علی",
        comment:
          "من خودم پاور بانک دارم ، خیلی مطالب شما مفید و کاربردیه ، اگر بخوام به کسی پیشنهاد بدم چطور بخره ، حتما سایت شما رو معرفی میکنم",
      },
      {
        id: "m6-2",
        name: "آرتمیس",
        comment: "خیلی مفید بود ، تشکر",
      },
      {
        id: "m6-3",
        name: "طاهره",
        comment: "خیلی خوب توضیح دادین ، ممنون",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>فرق سری A و M گوشی های سامسونگ چیست؟</h2>
          <p>
            اگه بخواید گوشی سامسونگ بخرید و بودجه تون متوسط باشه ، به احتمال
            خیلی زیاد این سوال واستون پیش میاد که سری A بخرید یا سری M . چون
            مشخصات این دو تا سری تقریبا شبیه به همه و شاید شما رو سردرگم کنه .
            تو این پست میخوام فرق سری A و سری M سامسونگ رو توضیح بدم که بتونید
            راحت تر انتخاب کنید .
          </p>
          <img
            src={mobileItem7__pic1}
            alt="ax"
            data-tip="مقایسه سری M و سری A سامسونگ"
          />
          <h2>سری های سامسونگ</h2>
          <p>
            گوشی های سامسونگ در دسته بندی های مختلف طراحی و تولید میشن . سری S
            که پرچم دار سامسونگه ، سری Z که اونم پرچم داره ولی گوشی های تاشو
            هستن ، سری نوت Note که اونم یه جورایی پرچم داره ولی با قلم نوری
            ارائه میشه و معمولا نمایشگرهای بزرگتری دارن ، سری A که یه پله زیر
            سری S هستن و به عنوان سری میان رده رو به بالا هستن ، سری M که میان
            رده تقریبا رو به پایین هستن . سری A و سری M تو بعضی چیزا شباهت دارن
            و تو یه سری چیزا تفاوت . تمرکز این پست روی تفاوت سری M و سری A هستش
            .
          </p>
          <h2>نگاهی به سری A سامسونگ</h2>
          <img
            src={mobileItem7__pic2}
            alt="ax"
            data-tip="گوشی های سری A سامسونگ"
          />
          <p>
            حرف A در این سری، از واژه آلفا Alpha گرفته شده . سری A سامسونگ سری
            میان رده رو به بالای گوشی های سامسونگ هستن . یعنی چی؟ یعنی گوشی پرچم
            دار نیستن ولی ویژگی های خوبی هم دارن . به پای گوشی های سری S سامسونگ
            نمیرسن اما نسبت به قیمت شون ، دوربین و باتری و&nbsp; نمایشگر خوبی
            دارن . سری پرچم دار معمولا بهترین دوربین و نمایشگر و باتری و رابط
            کاربری و این چیزا رو دارن اما گوشی میان رده همونطور که از اسم شون هم
            مشخصه همه چیز رو به طور متوسط رو به بالا داره .
          </p>
          <p>
            سری A ویژگی عجیب و غریب نداره ، مثلا دوربین با زوم خفن ، یا نمایشگر
            خمیده و از این چیزا ، تو یه جمله ، سری A چیزایی داره که کاربر نیاز
            داره . نیاز واقعی ! مثلا باتری خوب ، نمایگشر خوب ، دوربین خوب .
            اینایی که گفتم همشون خوبن ، یعنی عالی نیستن ولی کاربر رو راضی نگه
            میداره . بازم بخوام خلاصه تر بگم ، سری A واسه کساییه که پول زیادی
            ندارن یا نمیخوان برای گوشی خیلی هزینه کنن ، ولی دوربین و باتری و
            نمایگشر خوب و مناسب میخوان .
          </p>
          <p>
            سری A پر فروش ترین سری گوشی های سامسونگ در کل دنیاست ، چون ارزش خرید
            بالایی داره . ارزش خرید یعنی اینکه با پولی که میدی ، چه چیزی دریافت
            میکنی؟ نسبت به قیمت ، سری اِی ، ویژگی های خوبی داره .
          </p>
          <h2>نگاهی به سری M سامسونگ</h2>
          <img
            src={mobileItem7__pic3}
            alt="ax"
            data-tip="
          گوشی های سری M سامسونگ
          "
          />
          <p>
            سری M سری اقتصادی سامسونگه . یعنی برای افرادی طراحی شده که بودجه
            محدودی دارن اما گوشی معقولی میخوان . به هر حال شرکت باهوش و بزرگی
            مثل سامسونگ ، از جمعیت زیاد هند و چین و اندونزی و … نمیتونه بگذره .
            توی این کشورها ، افراد کم درامد زیادی زندگی میکنن که به گوشی هوشمند
            نیاز دارن . سری M سامسونگ برای این افراد طراحی شده . گوشی های موجود
            در سری M گوشی هایی هستن که باتری و نمایشگر و دوربین معقولی دارن اما
            خب از سر و ته بقیه چیزا زده شده ، مثل طراحی و مواد اولیه و پشتیبانی
            نرم افزاری و آپدیت و این چیزا .&nbsp;سری M جایگزین سری J سامسونگه .
          </p>
          <h2>چرا قیمت سری M از سری A کمتره ؟</h2>
          <p>
            بعد از 22 سال زندگی ، خیلی خوب فهمیدم و میدونم که هییییچ ارزونی بی
            دلیل و بی حکمت نیست . از پرتقال بگیر تا گوشی و ماشین ! دو تا محصول
            از یک شرکت ، اگه بخوان با قیمت متفاوت عرضه بشن ، حتما باید یکیشون رو
            بی کیفیت تر طراحی کرد یا خلاصه از سر و ته یه چیزیش بزنی تا بشه قیمت
            رو پایین تر آورد. سری M معمولا قیمت کمتری نسبت به سری A داره . دلیل
            این مسئله اینه که از سر و ته یه سری چیزا توی سری M زدن . البته قیمت
            سری M تو جهان کمتره ، تو ایران شاید حتی گرون تر هم باشه چون این گوشی
            ها فروش محدود دارن و سیم کارت شون هم مخصوص چندتا کشور محدوده ، این
            یعنی ایرانیا باید یه سری اضافه کاری بکنن تا بتونن اونو تو ایران قابل
            استفاده کنن که همین مسئله هزینه اضافه میتراشه .
          </p>
          <p>
            از طرف دیگه یه سیاست جالبی که سامسونگ در پیش گرفته اینه که سری m رو
            آنلاین میفروشه ( تو کشور هند و همون اطراف ) . وقتی شما یه چیزی رو
            آنلاین میفروشید دیگه پول تاسیس فروشگاه یا مکان نگهداری جدید برای اون
            چیز رو نمیدید . سامسونگ تو انبارهای خودش سری m رو نگهداری میکنه و
            سفارش ها رو به صورت آنلاین میفروشه . اینجوری میتونه هزینه های خودش
            رو کم کنه و در نهایت قیمت تمام شده گوشی هم میتونه کمتر بشه دیگه ولی
            سود سامسونگ در نهایت بیشتر میشه . یعنی هم مشتری راضیه هم سامسونگ .
          </p>
          <h2>مقایسه سری M و سری A سامسونگ</h2>
          <p>
            ببینید ، تو نگاه اول شاید خیلی از مشخصات سری A و سری M سامسونگ شبیه
            هم باشه و پیش خودتون بگید اینا که فرقی با هم ندارن اما وقتی توی
            مشخصات شون ریز بشید ، یه سری تفاوت های جزئی میبینید که شاید واسه
            بعضیا مهم باشه . مثلا تو بعضی مدل های سری A ، میزان روشنایی نمایشگر
            یه مقدار بیشتر از بعضی مدل های سری M هستش ( یا برعکس ) . این تفاوت
            به قدری ناچیزه که شاید با چشم عادی متوجه نشید و فقط تو آزمایشگاه بشه
            این مسئله رو تشخیص داد .
          </p>
          <p>
            یا مثلا زوم دوربین تو بعضی مدل های سری A از نوع اپتیکال هستش ولی تو
            سری M زوم دوربین به صورت دیجیتال هستش .{" "}
            <Link to="/" style={{ color: "red" }}>
              تفاوت زوم دیجیتال و اپتیکال
            </Link>
            رو قبلا توضیح دادم . اینارو دارم مثال میزنم شاید یه مثال نقض هم وجود
            داشته باشه ولی دارم میگم که بدونید چه جور تفاوت هایی ممکنه وجود
            داشته باشه .
          </p>
          <p>
            یا مثلا تو بعضی مدل ها ، سری A پردازنده بهتری داره یا پردازنده
            گرافیکی بهتری داره . اما اینا تفاوت های جزئی هستن که شاید نتونه رو
            انتخاب شما تاثیر زیادی بذارن . اون چیزی که میتونه نظر شما رو تغییر
            بده رو در ادامه میگم .
          </p>
          <h2>فرق سری A و سری M سامسونگ</h2>
          <p>■ به طور خلاصه :</p>
          <p>
            ■ سری A تو ایران زیاده ولی سری M به اندازه A نیست . این یعنی چی ؟
            این یعنی خدمات پس از فروش ، تعمیرات ، قطعات ، قاب ، گلس و چیزای دیگه
            برای سری A بیشتره و راحت تر بهش دسترسی دارید .
          </p>
          <p>
            ■ اگه دنبال گوشی زیباتری هستید ، سری A انتخاب بهتریه . در کل سری A
            دیزاین بهتری داره .
          </p>
          <p>
            ■ اگه دنبال گوشی زیباتری هستید ، سری A انتخاب بهتریه . در کل سری A
            دیزاین بهتری داره .
          </p>
          <p>
            ■ اگه همیشه غم شارژ دارید و باتری واستون مهمه ، سری M گزینه بهتریه و
            اصن سامسونگ سری M رو با باتری های بزرگ ، از بقیه سری ها مجزا کرده .
          </p>
          <p>
            ■ نکته دیگه اینه که تمرکز سری M روی باتری با ظرفیت بالاست، به همین
            دلیل وزن سری M معمولا از سری A یه مقدار بیشتره . اگه وزن گوشی واستون
            مهمه ، سری A گزینه بهتریه .
          </p>
          <p>
            ■ معمولا سنسور اثر انگشت سری A داخل نمایشگره ولی سری M به صورت
            فیزیکیه یعنی یا کنار گوشیه یا پشت گوشی . خودتون ببینید با کدوم راحت
            ترید .
          </p>
          <p>
            ■ یکی از مهمترین تفاوت های سری M و سری A سامسونگ توی نرم افزار
            اوناست . رابط کاربری ، اپلیکیشن های امنیتی و آپدیت و پشتیبانی و از
            این چیزا . مثلا رابط کاربری سری A بهتر از سری M هستش . یا مثلا
            قابلیت Samsung Pay ( سیستم پرداخت آنلاین سامسونگ ) فقط روی سری A
            وجود داره . از اونجایی که ایرانیا کلا از دنیا قطع هستن ، این مسائل
            خیلی واسه ما مهم نیست . یا مثلا سامسونگ برای سری A آپدیت و پشتیبانی
            4 ساله داره اما برای سری M اینجوری نیست .
          </p>
          <p>
            در کل اگه بودجتون میرسه ، یه گوشی از سری A بگیرید . ولی قبلش مدل
            همسان اونو تو سری M هم چک کنید و مشخصات شون رو مقایسه کنید . شاید
            مدل همسان اون تو سری M ، مشخصات بهتری اصن داشته باشه . مثلا دوربین
            بهتر یا باتری بهتر . بستگی داره چه چیزی واسه شما مهم تره .
          </p>
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews7;
