import React, { Component } from "react";
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  mobileItem6__pic1,
  mobileItem6__pic2,
  mobileItem6__pic3,
  mobileItem6__pic4,
} from "../../../../Components/NewsImage/NewsImage";
//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews6 extends Component {
  state = {
    commentsArray: [

    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>حافظه Micro SD چیست ؟ اجزای داخلی Micro SD</h2>
          <p>
            واقعا چجوری میشه تو یه کارت حافظه موبایل که کوچیک تر از ناخن دستتونه
            مثلا 512 گیگا بایت اطلاعات جا داد ؟ 512 گیگابایت یعنی 512 میلیارد
            بایت و هر بایت هم 8 بیت هست . یعنی بیش از 4 هزار میلیارد بیت ( صفر و
            یک ) جا خوش کردن . باورتون میشه ؟ بشه یا نشه این اتفاق واقعا میفته .
            حالا بریم ببینیم این حافظه SD که الان کوچیکتر شده و بهش میگن حافظه
            Micro SD چیه و چجوری این کارها رو انجام میده پس تا انتهای پست همراه
            من باشید .
          </p>
          <h2>حافظه Micro SD چیست ؟</h2>
          <p>
            SD مخفف عبارت Secure Digital به معنی دیجیتال ایمن هست . حالا چرا
            ایمن ؟ به دو دلیل ، یکی قفل سخت افزاری و دیگری به دلیل قفل نرم
            افزاری . قفل سخت افزاری همون اسلاید کوچیک کنار حافظه SD هست که وقتی
            اونو به حالت قفل تغییر وضعیت بدید ، دیگه با اطلاعات داخل حافظه کاری
            نمی تونید بکنید فقط می تونید بخونیدشون ( Read Only ) . قفل نرم
            افزاری به نوعی حمایت از حقوق ناشران موزیک به حساب میاد . داستانش
            طولانیه فقط در این حد بدونید که اگه اطلاعات طی فرآیند خاصی رمز نگاری
            بشه دیگه کسی نمی تونه اون اطلاعات رو کپی کنه و زحمات چندساله موزیک
            ساز رو به خاک و خون بکشه .
          </p>
          <p>
            حافظه Micro SD نوعی از مموری کارت هایی است که با قطع برق اطلاعات
            خودش رو از دست نمیده . تو انگلیسی به این نوع حافظه ها میگن ” Non
            Volatile ” . مثلا حافظه رم کامپیوتر اینجوری نیست و دلیلش رو هم در
            پست ”{" "}
            <Link to="/computer-item-11" style={{ color: "red" }}>
              چرا حافظه رم با قطع برق اطلاعات خود را از دست می دهد
            </Link>{" "}
            ” نوشتم . از&nbsp;حافظه Micro SD در موبایل ، تبلت ، لپ تاپ و دوربین
            عکاسی و فیلم برداری و دیگر وسائل الکترونیکی جهت ذخیره سازی اطلاعات
            مثل عکس ، صدا و فیلم استفاده میشه .
          </p>
          <p>
            از ابتدا حافظه های SD بودن که اندازه بزرگی داشتن و به مرور زمان Mini
            SD طراحی شد و الان هم حافظه Micro SD که عبارت مایکرو Micro به معنی
            خیلی کوچیک هست .
          </p>
          <img
            src={mobileItem6__pic1}
            alt="
            حافظه فلش SD تا حافظه Micro SD"
            data-tip="
          حافظه فلش SD تا حافظه Micro SD"
          />
          <h2>اجزای داخلی حافظه SD</h2>
          <p>
            اگه دم دستتون یه حافظه SD باشه ( از این کارت حافظه بزرگا که بیشتر
            برای دوربین ها و موبایل های قدیمی 8 &nbsp;، 7 سال پیش بود ) با یه
            تیغ تیز می تونید پکیجش رو باز کنید و داخلش رو ببینید . حافظه های فلش
            مثل فلش مموری ها و کارت های حافظه ، معمولا از یک چیپ حافظه مثلا 32
            گیگ یا 16 گیگ و یک عدد چیپ کنترل کننده و تعدادی قطعه الکترونیکی دیگه
            مثل خازن و مقاومت تشکیل شدند .
          </p>
          <h2>اجزای داخلی حافظه Micro SD</h2>
          <p>
            کارت های حافظه Micro SD رو نمی تونید باز کنید چون به صورت پرس شده
            هستن اما زیر همون پلاستیک محکم ، قطعاتی که در کارت های حافظه SD هستن
            استفاده میشن اما در ابعاد بسیار کوچک تر . قدیما که بازی های سگا و
            میکرو بودن ، داخلشون رو که باز میکردی یه مدل آی سی می دیدید که به آی
            سی قیری معروف بودن . شبیه قیر بودن ، زیر این قیر که در واقع یک ترکیب
            شیمیایی به نام Epoxy هست ، یک مدار مجتمع بسیار کوچک وجود داره که در
            کارت های حافظه Micro SD هم از این نوع مدار که معروف به&nbsp;
            <a
              href="http://en.wikipedia.org/wiki/Electronic_packaging"
              rel="noopener noreferrer"
            >
              COB{" "}
            </a>
            هست استفاده میشه . COB مخفف عبارت Chip On Board هست . شکل زیر رو
            ببینید :
          </p>

          <img
            src={mobileItem6__pic2}
            alt="
            بسته بندی COB در الکترونیک – آی سی قیری"
            data-tip="
          بسته بندی COB در الکترونیک – آی سی قیری"
          />
          <p>
            فرآیند تولید حافظه Micro SD خیلی جالبه . این کارت های حافظه موبایل
            ابتدا در تعداد زیاد ، قالب بندی میشن و یک پلاستیک ساده بزرگ روی یک
            قالب خاص قرار میگیره . مثلا 20 تا کارت حافظه موبایل روی یک قالب بزرگ
            هستن که بعدا برش می خورن . بعد مدار الکتریکی یا PCB اون طراحی و کار
            گذاشته میشه ، اجزای الکترونیکی مثل خازن و مقاومت از طریق روش SMT روی
            بورد قرار میگیرن ، آی سی ها که شامل حافظه فلش و همچنین کنترل کننده
            حافظه هست از طریق روش COB روی بورد سوار میشن . سپس توسط روش پکیجینگ
            یک نوع پلاستیک محکم روی اون میکشن . بعد از این کار ، این قالب بزرگ
            توسط روش های برش مثل برش لیزر و یا واترجت ( فشار آب ) به قسمت های
            کوچک تر که همون کارت حافظه موبایل هستن برش می خوره . البته از گفتن
            ریزه کاری ها اجتناب کردم چون الکی شلوغ میشد . شکل زیر نمای کلی از
            اجزای داخلی یک حافظه Micro SD رو نشون میده .
          </p>
          <img
            src={mobileItem6__pic3}
            alt="اجزای داخلی حافظه Micro SD"
            data-tip="اجزای داخلی حافظه Micro SD"
          />
          <h2>عملکرد حافظه فلش و کنترل کننده در حافظه Micro SD چیست ؟</h2>
          <p>
            حافظه فلش که بعدا به طور مفصل در موردش توضیح میدم همون طور که از
            اسمش مشخصه برای ذخیره سازی اطلاعات با سرعت بالا استفاده میشه . سرعت
            خوندن و نوشتن و پاک کردن و … بستگی به نوع کلاس حافظه داره که اینم
            بعدا مفصل توضیح میدم . فقط باید صبور باشید .
          </p>
          <p>
            اما قسمت کنترل کننده حافظه ، وظیفه هماهنگ سازی بین حافظه فلش و
            دستگاه جانبی مثل لپ تاپ و تبلت و موبایل رو داره . کارهایی مثل
            copy/paste کردن اطلاعات ، فرمت کردن ، پاک کردن ، مدیریت انرژی (
            ولتاژ ) ، ایمن سازی دیجیتال ، کنترل خانه های حافظه ، کنترل کلاک و …
            توسط کنترل کننده حافظه ، انجام&nbsp;میشه .
          </p>
          <img
            src={mobileItem6__pic4}
            alt="دیاگرام داخلی حافظه Micro SD – مایکرو اس دی"
            data-tip="دیاگرام داخلی حافظه Micro SD – مایکرو اس دی"
          />
          <p>
            در مورد حافظه Micro SD حرف زیاد میشه زد . فعلا تا همین جا کافیه تا
            بعدا در پست های جداگونه بیشتر توضیح بدم .
          </p>
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews6;
