import React, { Component } from "react";
import { Fade } from "react-reveal";
import { Link } from "react-router-dom";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";

//React
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews15 extends Component {
  state = {
    commentsArray: [
      {
        id: "m6-1",
        name: "علی",
        comment:
          "من خودم پاور بانک دارم ، خیلی مطالب شما مفید و کاربردیه ، اگر بخوام به کسی پیشنهاد بدم چطور بخره ، حتما سایت شما رو معرفی میکنم",
      },
      {
        id: "m6-2",
        name: "آرتمیس",
        comment: "خیلی مفید بود ، تشکر",
      },
      {
        id: "m6-3",
        name: "طاهره",
        comment: "خیلی خوب توضیح دادین ، ممنون",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade bottom>
        <div className={styles.newsContent}>
          <h2>چرا در گوشی ها از دو LED فلش استفاده میشه</h2>
          <p>
            اگه به&nbsp;مشخصات گوشی های جدید نگاه کنید توی مشخصات دوربین ، گزینه
            Dual LED و یا True Tone Flash و یا Dual Tone رو خواهید دید . خب گوشی
            های قدیمی تر همگی با یک فلش LED طراحی و تولید می شدن اما به تازگی مد
            شده که توی گوشی های جدید از دو تا فلش LED استفاده میشه . اما دلیل
            استفاده از دو تا دیود نورانی LED چیه ؟
          </p>
          <img
            src=""
            alt=""
            data-tip="استفاده از دو تا LED در گوشی آیفون 5 اس و آیفون 6"
          />
          <h2>دو تا فلش LED در موبایل های ساده</h2>
          <p>
            یه سری گوشی های چینی شاید تو بازار باشن که از دو تا فلش LED استفاده
            کرده باشن . اینجور گوشی ها صرفا برای برد بیشتر نور و پراکندگی بیشتر
            نور این کار رو می کنن . شاید یک عدد دیود نورانی برای روشن کردن یه
            محیط نسبتا تاریک کافی نباشه اما وقتی دو تا فلش LED استفاده بشه ،
            نورها با هم جمع میشن .
          </p>
          <p>
            توی این گوشی های چینی شاید خبری از کنترل هوشمند نور نباشه و همونطور
            که گفتم ، استفاده از دو عدد فلش LED صرفا به خاطر نور بیشتر باشه .
            اما در گوشی های پیشرفته تر ، استفاده از دو تا فلش{" "}
            <a href="http://en.wikipedia.org/wiki/Light-emitting_diode">LED </a>
            فقط برای افزایش نور نیست بلکه کارهای دیگه ای هم میشه کرد .
          </p>
          <h2>تکنولوژی True Tone در دوربین گوشی</h2>
          <p>
            تا جایی که من می دونم مثل اینکه برای اولین بار در گوشی موبایل ، اپل
            روی آیفون 5 اس ، از تکنولوژی True Tone استفاده کرد . به این شکل که
            اولا به جای یک عدد دیود نورانی ، از دو تا دیود نورانی استفاده کرد ،
            دوم اینکه یکی از لامپ ها به رنگ سفید و یکی دیگه به رنگ زرد طراحی شده
            بود .
          </p>
          <p>
            اپل میگه استفاده از نورهای ترکیبی سفید و زرد علاوه بر برد بیشتر نور
            ، می تونه بنا به محیطی که سوژه درونش هست ، دمای نور رو تنظیم کنه ،
            به زبان ساده یعنی اگه یه جایی باشیم که رنگ زرد غالب باشه ، به طور
            اتوماتیک و توسط سیستم عامل ، نور سفید بیشتر از فلش دوربین ساطع میشه
            تا تعادل نوری برقرار بشه .
          </p>
          <img src="" alt="" data-tip="تکنولوژی True Tone در دوربین گوشی" />
          <p>
            اپل میگه :&nbsp;به جای اینکه تلاش کنیم ، تمام مردم رو عکاس حرفه ای
            کنیم ، شاید بهتر باشه گوشی های حرفه ای تر بزنیم ، تکنولوژی True Tone
            در اپل آیفون 5 اس و همینطور آیفون 6 می تونه به طور خودکار ، عکس های
            بهتر و متعادل تری بگیره .
          </p>
          <p>
            جالبه بدونید ، با تکنولوژی&nbsp;True Tone در دوربین گوشی با الگوریتم
            خاصی میشه به 1000 حالت مختلف و البته یکتا ( Unique ) دست پیدا کرد .
            یعنی 1000 تا رنگ با دمای مختلف !!
          </p>
          <img
            src=""
            alt=""
            data-tip="دیود نوری سفید و زرد در تکنولوژی True Tone آیفون 6"
          />
          <p>
            در شکل بالا ، نمای نزدیک از جلو و پشت دیود های نورانی استفاده شده در
            تکنولوژی Dual LED و یا True Tone آیفون 6 رو می بینید .
          </p>
          <ReactTooltip />
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews15;
