//React
import React, { Component } from "react";
import { Fade } from "react-reveal";
import ReactTooltip from "react-tooltip";
import Comments from "../../../../Components/Comments/Comments";
import {
  mobileItem3__pic1,
  mobileItem3__pic2,
} from "../../../../Components/NewsImage/NewsImage";
//React
//Images
//Images
//CSS
import styles from "../../MASTER__STYLE.module.css";
//CSS
//Modules
//Modules

class MobileNews3 extends Component {
  state = {
    commentsArray: [
      {
        id: "m3-1",
        name: "وحید",
        comment:
          "خیلی خوب شد ، من همیشه از گوشیم توی همه ی حالت ها استفاده میکردم",
      },
      {
        id: "m3-2",
        name: "عاطفه",
        comment: "عالی ، فقط همین رو میتونم بگم",
      },
      {
        id: "m3-3",
        name: "رویا",
        comment: "خیلی خوب و روون توضیح میدین ، ممنونم",
      },
    ],
  };
  componentDidMount() {
    if (window.innerWidth < 500) {
      window.scrollTo({ top: 127 });
    } else if (window.innerWidth > 1900) {
      window.scrollTo({ top: 190 });
    } else if (window.innerWidth > 1300) {
      window.scrollTo({ top: 120 });
    } else if (window.innerWidth < 800) {
      window.scrollTo({ top: 130 });
    }
  }
  render() {
    return (
      <Fade left>
        <div className={styles.newsContent}>
          <ReactTooltip />
          <h2>آیا استفاده از گوشی هنگام شارژ کردن خطرناکه ؟</h2>
          <p>
            خب بعد از یک سری اتفاقات که در دنیا افتاد و چندسال پیش هم خبر مرگ یه
            زن چینی هنگام استفاده از گوشی آیفون موقع&nbsp;شارژ تو کل خبرگزاری ها
            پیچید خیلی ها دیگه واقعا می ترسن که هنگام شارژ از تلفن همراه خودشون
            استفاده کنن . من در ویدیوی زیر به صورت خلاصه توضیح دادم که آیا واقعا
            کار کردن با گوشی در حال شارژ می تونه خطرناک باشه یا نه . پس حتما
            ویدیوی زیر رو ببینید و واسه دوستان تون هم بفرستید .
          </p>
          <h2>استفاده از شارژر و باتری تقلبی در گوشی موبایل</h2>
          <img
            src={mobileItem3__pic1}
            data-tip="استفاده از گوشی هنگام شارژ کردن"
            alt="استفاده از گوشی هنگام شارژ کردن"
          />
          <p>
            بنا به&nbsp;تجربه دیدم ، طرف میاد تو مغازه میگه آقا شارژر سامسونگ
            فلان رو داری ؟ مغازه دار میگه اره داریم قیمتش ۲۵ تومنه ، خریدار
            قیافشو کج و معوج میکنه میگه : ” داداش مغازه پایینی میده ۳ هزار تومن
            تو چجوری میدی ۲۵ هزار ؟ ” یعنی واقعا من خودمو میذارم جای فروشنده تو
            اون لحظه فقط میخوام غیب شم طرفو نبینم . مشتری میره شارژر چینی ارزون
            واسه گلکسی اس ۴ می خره و خوشحال از اینکه زرنگ بازی دراورده و به خودش
            میگه من خودم گرگ بیابون و مرد خیابونم . اونوقت یه مشکلی واسه گوشیش
            پیش میاد نمی دونه که آدم کِنِس ، دوبار باید خرج کنه ( خرج دوم ناشی
            از خساست در بار اوله ) .
          </p>
          <p>
            در مورد باتری هم همینطوره . باتری اصلی داریم ، باتری فرعی داریم .
            قطعا یه فرقی بین اینا هست که دسته بندی شدن و قیمتشون با هم فرق داره
            . شارژر و باتری می خوان سالی یه بار ۲ سالی یه بار خراب شن &nbsp;حالا
            اصلا ۵۰ هزار هم پول این دوتا رو بده ولی در عوض خیالت راحته که مشکلات
            خنده دار واست پیش نمیاد !
          </p>
          <h2>باتری و شارژر متفرقه چجوری باعث خرابی یا انفجار میشه ؟</h2>
          <p>
            ببینید باتری گوشی در مدت زمان خاصی ذره ذره جریان رو از شارژر میکشه
            تا پر از{" "}
            <a href="http://fa.wikipedia.org/wiki/%D8%A8%D8%A7%D8%B1_%D8%A7%D9%84%DA%A9%D8%AA%D8%B1%DB%8C%DA%A9%DB%8C">
              بار الکتریکی
            </a>{" "}
            بشه ( فول شارژ بشه ) . مثلا اگه یه باتری ۱۰۰۰ میلی آمپر ساعت باشه می
            تونه تا یک ساعت و در هر لحظه ۱۰۰۰ میلی آمپر یا همون ۱ آمپر رو به
            گوشی منتقل کنه . این باتری ، خودش باید از یه جایی تامین یا پر بشه ،
            شارژر این کارو میکنه و دقیقا همین نقطس که باعث بروز مشکل میشه .
          </p>
          <p>
            شارژر گوشی یه جریان خروجی داره و یه ولتاژ خروجی ، ولتاژ که معمولا ۵
            ولته ولی جریانی که به باتری می رسونه تا شارژ بشه می تونه متفاوت باشه
            . شارژر های متفرقه یا ارزون قیمت ، مقدار جریان کمتری رو می تونن
            تولید کنن . مثلا شارژر های اصلی ۲ آمپرن ( مثلا ) اما شارژرهای فرعی
            ۰٫۸ آمپرن ( ۸۰۰ میلی آمپر ) . حالا این یعنی چی ؟ یعنی شارژر می تونه
            برای شارژ کردن باتری در یک ساعت ۲ آمپر رو بهش برسونه تا شارژش کامل
            شه . هرچی آمپر شارژر بیشتر باشه ، باتری سریع تر شارژ میشه . مثلا
            باتری با شارژر ۲ آمپر خیلی زودتر از شارژر با ۰٫۸ آمپر شارژ میشه .
            امیدوارم متوجه شده باشید . بعدا تو یه پست مفصل در مورد باتری و
            مفاهیمش توضیح میدم.
          </p>
          <p>
            حالا هرچی مقدار جریانی که شارژر میده کمتر باشه ، مدت زمان بیشتری طول
            میکشه تا باتری شارژ بشه و این مسئله باعث میشه که باتری مدت زمان
            بیشتری تحت فشار قرار بگیره و به مرور زمان باتری باد میکنه . باتری
            های تقلبی اتصالات داخلی درست حسابی ندارن یعنی فعل و انفعالات درون
            باتری میتونه اتصال کوتاه داخل باتری ایجاد کنه و اینجوری میشه که یهو
            باتری میترکه یا آتیش میگیره !
          </p>
          <img
            src={mobileItem3__pic2}
            data-tip="بادکردن باتری به خاطر شارژ طولانی"
            alt="بادکردن باتری به خاطر شارژ طولانی"
          />
          <p>
            از طرفی توی اسمارت فون ها از باتری لیتیوم یون استفاده میشه و سیستم
            هوشمند گوشی و باتری ، اجازه شارژ بیش از اندازه رو نمیده ، اگه از
            باتری های متفرقه واسه گوشی خودتون استفاده کنید احتمال اینکه نظمِ
            سیستمِ هوشمندِ قطعِ شارژ رو به هم بزنه و اصلا عمل نکنه بیشتر میشه .
          </p>
          <p>
            شارژرهای ارزون قیمت مدار داخلی با کیفیتی ندارن و اگه حین مکالمه شما
            با گوشی ، شارژر به موبایل وصل باشه احتمال اینکه شارژر قاطی بکنه و
            برق شما رو بگیره هست البته این احتمال تقریبا ۱ به ۷ میلیارده و اگه
            یه روز این اتفاق واستون افتاد من مطمئن میشم که یه نفر از من بدشانس
            تر هم تو دنیا وجود داره
          </p>
          <p>
            اینها عواملی است که باعث میشه شما فکر کنید استفاده از گوشی موقع شارژ
            کردن اشتباهه در صورتی که اگه از باتری و شارژر استاندارد و اصلی
            استفاده کنید هیچ مشکلی واستون پیش نمیاد .
          </p>
          <p>
            یه نکته تا یادم نرفته بگم که وقتی شارژ باتری کمه ، توصیه میشه که
            کارهای سنگین با گوشی انجام ندید ، کارهایی مثل بازی های گرافیک بالا و
            یا ادیت صوت و تصویر که بیشترین پردازش ها رو دارن . این کار باعث گرم
            شدن باتری میشه چون سعی میکنه هم شارژ بشه و هم شارژ برسونه .
          </p>
          <p>
            به طور خلاصه باید بگم که گوشی موبایل مشکل ساز نیست ، چیزی که مشکل
            درست می کنه یا باتریه یا شارژر . که شارژر سهم بیشتری داره .
          </p>
          <Comments commentsArray={this.state.commentsArray} />
        </div>
      </Fade>
    );
  }
}

export default MobileNews3;
